{"AT": {"vaccine_info": {"entry_status": "Allowed", "info": "Proof of full vaccination: \nThe following vaccines (including mix-and-match vaccines) are recognised: \nBioNtech/Pfizer, AstraZeneca, Johnson & Johnson, Moderna. Full immunisation (both doses of the vaccine OR Johnson & Johnson + 22 days OR recovery from COVID + one dose) is required. \n\nA vaccination certificate/vaccination card/vaccine passport in German or English can be used as proof of vaccination; OR\n\nAttention! \nA single vaccination with Johnson & Johnson will only be recognised until 3 January 2022. After that date, a booster is required.", "source": "https://www.austria.info/en/service-and-facts/coronavirus-information/tests", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Allowed", "info": "There are no restrictions imposed on public and private gatherings.", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Fully Open", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}, "BE": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "All fully vaccinated travellers from green, orange and red countries (EU countries) with one of the European Medicines Agency authorised vaccines (Moderna, AstraZeneca, Pfizer and Janssen) and that can show the vaccination certificate upon arrival are allowed to travel to Belgium without being tested or quarantined.\n\nAs SchengenVisaInfo.com recently reported, Belgium has also recognised the CoviShield vaccine, manufactured in India by the Serum Institute of India. This decision will help those vaccinated with the jab to be released from quarantine requirements while travelling to Belgium.", "source": "https://www.covidpasscertificate.com/covid-vaccines-for-travel-to-europe/", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Allowed", "info": "No restriction.", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Fully Open", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}, "BG": {"vaccine_info": {"entry_status": "Allowed", "info": "Fully vaccinated travelers are allowed to enter without providing a negative PCR test.\n\nA vaccination certificate indicating that the holder has received one or two shots of the European Medicines Agency approved vaccines (Moderna, AstraZeneca, Pfizer and Janssen). The combination of one dose of AstraZeneca with a second dose of the Pfizer BioNTech vaccine is also considered as completed vaccination.\n\nThe vaccination certificate must include the name of the holder, birthdate, date of vaccination, trade and batch number of the COVID-19 vaccine, name of the manufacturer, the document’s issuing country and the competent authority’s name.", "source": "https://www.covidpasscertificate.com/covid-vaccines-for-travel-to-europe/", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Partially Allowed", "info": "Events for 50% of the capacity of the premises", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}, "CY": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "Fully vaccinated travelers are exempt from testing and quarantine requirements.\n\nThe complete list of vaccines that are accepted in Cyprus is as follows:\n\nBioNTech/Pfizer (Comirnaty)\nAstraZeneca (Vaxzevria)\nModerna (Spikevax)\nJohnson & Johnson (Janssen)\nAstraZeneca – Serum Institute of India (Covishield)\nSinovac (CoronaVac)\nSinopharm BIBP", "source": "https://www.visitcyprus.com/index.php/en/cyprus-covid19-travel-protocol", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Partially Allowed", "info": "for high risk places (events with more than 150 attendees), medium risk places (events with less than 150 attendees, or with more than 150 attendees but without a dancefloor; conferences and trade fairs) and for low risk places (flea markets, festivals).", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}, "CZ": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "Fully vaccinated travelers are exempt from testing and self-isolation.\n\nPfizer/BioNTech, AstraZeneca, Moderna, or Johnson and Johnson vaccine", "source": "https://koronavirus.mzcr.cz/en/recognition-of-vaccination-certificates-from-other-countries/", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Allowed", "info": "Allowed", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Fully Open", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}, "DE": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "Mandatory testing or proof of immunity for persons who have been vaccinated or recovered from COVID-19 \nUpon entering Germany, travellers aged twelve years or older must hold proof of the following:\n\nEntry from an area of variant of concern: negative COVID-19 test result. Proof of a full COVID-19 vaccination or proof of recovery from an infection is not sufficient.\nEntry from any other Country or area: a negative COVID-19 test result, proof of a full COVID-19 vaccination or proof of recovery from an infection.\nThis proof must be held prior to entering the country, and must be presented to the airline before departure where applicable.\n\nExemptions from requirement of testing or providing proof of immunity\nExemptions apply for\n\npersons, who only change flights at an airport\nTransport personnel\nIn the case of border traffic the following persons who have spent less than 24 hours\nin a high-risk area oder area of variant of concern\nIn the case of border traffic for stays of up 24 hours, the requirement only applies for entries from high-risk areas of areas of variant of concern or who enter Germany via air travel. In these cases a negative test result only needs to be presented twice per week.\n", "source": "https://www.pei.de/EN/medicinal-products/vaccines-human/covid-19/covid-19-node.html", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Partially Allowed", "info": "Each federal state can set specific rules for the maximum number of people allowed to meet together, with different limits applicable to indoor and outdoor spaces.", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}, "DK": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "Just like the majority of Schengen Area and European Union countries, Denmark has decided to allow travel to the country provided that the ones who enter its territory hold at least a vaccination certificate.\n\nStill, it has been announced by the country’s authorities that only a few vaccines are recognised for travel, SchengenVisaInfo.com reports.\n\nAccording to the Danish National Communications Partnership, Denmark only recognises the vaccines that have been approved for use by the European Medicines Agency.\n\nConsequently, this means that just the four vaccines listed below are recognised as valid proof of vaccination in Denmark:\n\nComirnaty Pfizer-BioNTech by BioNTech Manufacturing GmbH\nSpikevax, formerly Moderna by Moderna Biotech Spain, SL\nVaxzvria, formerly AstraZeneca by AstraZeneca Ab\nJanssen (Johnson & Johnson) by Janssen – Cilag International NV\n\n“In Denmark, you are considered to be fully vaccinated once you have been vaccinated with a vaccine approved by the European Medicines Agency (EMA), and at least two weeks and no more than twelve months have elapsed since you completed your course of vaccination,” Denmark’s official site on Coronavirus noted.\n\nIn addition, it has been noted that a vaccination certificate is only valid if it is part of the EU Digital COVID-19 Certificate.\n\nAccordingly, for the vaccination certificate to be considered valid, it should include the following information on the holder:\n\nName\nDate of birth\nName of the vaccine\nDate(s) when the vaccine(s) has been administered\n\nRelevant vaccination documents that belong to a permanent resident of an EU/Schengen Area country Andorra, San Marino, Monaco, the Vatican City State, an OECD member state, or a yellow-listed third country are also recognised in Denmark.", "source": "https://www.covidpasscertificate.com/covid-vaccines-for-travel-to-europe/", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Allowed", "info": "There is no limit to how many people can gather outdoors.\nThere is a participation limit of 1,500 people indoors separated in three sections of maximum 500 people", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Fully Open", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}, "EE": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "If you hold an appropriate vaccine certificate, you are exempt from self-isolation and testing.\n\nAllowed Vaccines:\n\nModerna, Pfizer, AstraZeneca, and Janssen", "source": "https://www.schengenvisainfo.com/news/everything-you-need-to-know-about-travelling-to-estonia-amid-covid-19/", "last_updated": "2022-04-01"}, "entry_info": {"entry_status": "Partially Allowed", "info": "Only vaccinated or recovered people can join  swimming pools, fitness and other indoor sporting\nOrganised public events", "last_updated": "2022-04-01"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-01"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-01"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-01"}, "tourist_entry": "Partially Allowed"}, "ES": {"vaccine_info": {"entry_status": "Allowed", "info": "The Spanish authorities have announced that any of the vaccines that have been approved by the European Medicines Agency (EMA) and World Health Organization (WHO) are recognised by the country’s authorities, as proof of immunity against COVID-19 for incoming travellers.\n\nConsequently, this means that Spain recognises vaccination certificates as long as the holder has been immunised with one of the following vaccines:\n\nComirnaty – Pfizer/BioNTech Manufacturing GmbH.\nVaxzevria – AstraZeneca\nAstraZeneca/SK Bio, SK Bioscience Co. Ltd.\nVaccine AstraZeneca (Covishield™), Serum Institute of India Pvt. Ltd.\nJanssen-Cilag International NV.\nSpikevax; mRNA-1273), Moderna Biotech\nVero Cell – Sinopharm/Beijing Institute of Biological Products Co., Ltd.\nSinovac-CoronaVac (Vero Cell), Sinovac Life Sciences Co., Ltd.\nCovaxin\n“Any vaccine authorised for marketing by the European Union (European Medicines Agency, EMA) and WHO will be accepted. The complete vaccination schedule must be available for the vaccination certificate to be valid,” the official Travel Health Portal of Spain noted.", "source": "https://www.covidpasscertificate.com/covid-vaccines-for-travel-to-europe/", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Partially Allowed", "info": "Physical distancing measures must be guaranteed and maximum precautions must be taken to avoid meetings and overcrowding in indoor places", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}, "FI": {"vaccine_info": {"entry_status": "Allowed", "info": "Persons who have received a complete and valid vaccination series may  be granted entry into Finland from any country, provided that at least 14 days have passed since the last vaccine dose has been received. \n\nAccepted vaccine in Finlad: \nComirnaty (Pfizer-BionTech), Spikevax/Moderna, Vaxzevria/AstraZeneca), Janssen (Johnson&Johnson), BIBP/Sinopharm, COVISHIELD™, CoronaVac\n\nCheck this page (https://bit.ly/3BTz2QT) for updated list of accepted vaccines in Finland, as well as what kind of vaccination certificate you need.\n\nFully vaccinated travelers from other countries may enter the country.\n\nUnvaccinated travelers arriving without a negative test result or a certificate indicating recovery or first-dose vaccination will have to take a COVID-19 within 3-5 days after arrival.", "source": "https://raja.fi/en/guidelines-for-border-traffic-during-pandemic", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Partially Allowed", "info": "Public events organised indoors do not have a specified upper limit on the number of people, but events with more than 50 people are limited to 50% of the capacity of the event facility. Events with up to 50 people can be organised without restrictions on the relative number of participants. Public events organised outdoors are not restricted. ", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}, "FR": {"vaccine_info": {"entry_status": "Allowed", "info": "If you are vaccinated, you can travel to France with no restrictions linked to health conditions.\n\nThe measures applicable to vaccinated adults also apply to any minors accompanying them, whether they are vaccinated or not. You can therefore travel with your underage children, whether they are vaccinated or not, and they will not need to self-isolate. Unvaccinated children aged 12 and over will need to present a negative test result as described below.\n\nTravel documents if you are vaccinated:\n\n- Proof of vaccination. It will only be valid if it proves that you are fully vaccinated, i.e.:\nSeven days after the second shot for two-shot vaccines (Pfizer, Moderna, AstraZeneca (Vaxevria and Covishield));\nFour weeks after the shot for one-shot vaccines (Johnson & Johnson);\nSeven days after the shot for vaccines administered to people who have already had COVID-19 (only one dose is necessary).\nOnly vaccines authorized by the European Medicines Agency (EMA) (Pfizer (Comirnaty), Moderna, AstraZeneca (Vaxzevria), Johnson & Johnson (Janssen)), or AstraZeneca (Covishield) will be accepted.\nSeven days after a booster ARNm dose (Moderna or Pfizer) after two shots of a vaccine on the WHO’s health emergencies list (Sinovac/Coronavac or Sinopharm/BBIB-PVeroCells)\na sworn declaration, which you can download from the Interior Ministry’s website stating that\nyou have no symptoms of COVID-19 infection;\nto your knowledge, you have not been in contact with a confirmed case of COVID-19 in the 14 days prior to your journey.\nStarting on 15 December, people 65 and older or who were vaccinated with a Janssen vaccine must provide proof of booster vaccination for their COVID certificate to be extended.\n\nIf you are not vaccinated\nA list of countries of departure has been drawn up on the basis of the health indicators. The lists of countries can be altered based on changes in the epidemic situation.", "source": "https://www.diplomatie.gouv.fr/en/coming-to-france/coming-to-france-your-covid-19-questions-answered/procedure-for-non-european-nationals-to-obtain-a-valid-covid-certificate-in/", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Allowed", "info": "Seated public events that require face coverings are now allowed to exceed the previous limits of 2,000 people indoors and 5,000 people outdoors. ", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}, "GR": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "With the fast vaccination rate and the epidemiologic situation improving in Greece and other countries, the Greek authorities decided to open the borders for EU and third-country travellers back in May.\n\nHowever, in order to protect public health and ensure safe holidays for the tourists, the authorities imposed entry requirements against travellers, including proof of vaccination, which still remains effective.\n\nAs such, according to a travel protocol issued by the Government of Greece, the country accepts as valid proof of vaccination all of the vaccines listed below:\n\n1. Pfizer/BioNTech (Comirnaty)\n2. Moderna (Spikevax)\n3. AstraZeneca (Vaxzevria)\n4. Johnson & Johnson (Janssen)\n5. Sinovac (CoronaVac)\n6. AstraZeneca – Serum Institute of India (Covishield)\n7. Novavax\n8. Sputnik V\n9. Cansino Biologics\n10. Sinopharm BIBP\n\n“Acceptable vaccines are: Pfizer BioNtech, Moderna, AstraZeneca/Oxford, Novavax, Johnson + Johnson/Janssen, Sinovac Biotech, Gamaleya (Sputnik), Cansino Biologics, Sinopharm among others,” the Government said.", "source": "https://www.covidpasscertificate.com/covid-vaccines-for-travel-to-europe/", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Partially Allowed", "info": "A certificate of vaccination or recovery is required to access", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}, "HR": {"vaccine_info": {"entry_status": "Allowed", "info": "You can travel to Croatia if you present a vaccine certificate, proving that they have received two doses of vaccine used in the EU Member States (Pfizer, Moderna, AstraZeneca, Gamaleya, Sinopharm) not older than 365 days, or a certificate that they have received one dose of the vaccine if the vaccine is administered in a single dose (Janssen/Johnson&Johnson) not older than 365 days, provided that 14 days have passed since they received the single dose;\n\nYou wont need to present a negative PCR test nor to follow a quarantine.", "source": "https://mup.gov.hr/uzg-covid/english/286212", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Partially Allowed", "info": "Indoor public gatherings are limited to 100 people. No limitation if everyone attending has a digital COVID-19 certificate.\nOutdoor public gatherings are limited to no more than 200 people. No limitation if everyone attending has a digital COVID-19 certificate.", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}, "HU": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "Travelers fully vaccinated with a WHO-approved vaccine are exempt from the ban on non-essential travel and from testing and quarantine requirements.\n\nThe vaccines approved by Hungary are Pfizer-BioNTech, Moderna, AstraZeneca, Sputnik V, Sinopharm (Beijing), Sinovac (CoronaVac), CanSinoBio, Janssen, and CoviShield.", "source": "https://www.covidpasscertificate.com/covid-vaccines-for-travel-to-europe/", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Partially Allowed", "info": "EU Digital COVID Certificate -(EUDCC), a certificate recognized by Hungary or the EESZT application is mandatory to access all indoor events.\noutdoor events with more than 500 participants is not allowed.", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Allowed"}, "IE": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "Everyone arriving in Ireland must complete a Passenger Locator Form before boarding a flight or taking a boat to Ireland.\n\nYou must also have one of the following when you arrive in Ireland:\n\nAn EU Digital COVID Certificate that shows you are fully vaccinated with an EMA approved vaccine, or have recovered from COVID-19 in the past 180 days\nOther acceptable proof that you have been fully vaccinated with an approved vaccine, or you have recovered from COVID-19\nProof of a negative RT-PCR test taken no more than 72 hours before your arrival.\n\nFrom Sunday 5 December 2021, all arrivals aged 12 and over who are fully vaccinated or recovered from COVID-19 must provide either of the following:\n\nA negative or not detected antigen test (taken within 48 hours before arrival)\nA negative or not detected RT-PCR test (taken within 72 hours before arrival)\nThe test result must be certified and not self-administered.\n\nIf you are not fully vaccinated or recovered, you must show a negative or not detected RT-PCR test taken within 72 hours before your arrival.\n\nPeople arriving in Ireland do not need to quarantine, unless they have been in certain countries in southern Africa.\n\nIf you have symptoms of COVID-19 or are a close contact of a confirmed case, you should follow public health advice.", "source": "https://www.citizensinformation.ie/en/travel_and_recreation/travel_to_ireland/travel_to_ireland_during_covid.html", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Allowed", "info": "Activities have no limits on numbers. Organisers should have protective measures in place.", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Fully Open", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Allowed"}, "IT": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "A vaccination certificate has proven to be the most common and convenient form since it remains valid for up to one year. However, not all countries recognise the same vaccines as valid proof of immunity.\n\nAccording to a press release issued by the Italian Ministry of Health, it has been announced that the country accepts proof of vaccination only if the administered jab has been approved by the European Medicines Agency (EMA), SchengenVisaInfo.com reports.\n\n“The certification of successful completion of the vaccination cycle must relate to one of the four vaccines approved by the European Medicines Agency,” the Ministry stated.\n\nBased on the Ministry’s statement, it means that only the following vaccines listed below are recognised as valid proof of vaccination in Italy:\n\nComirnaty Pfizer-BioNTech by BioNTech Manufacturing GmbH\nSpikevax, formerly Moderna by Moderna Biotech Spain, SL\nVaxzvria, formerly AstraZeneca by AstraZeneca Ab\nJanssen (Johnson & Johnson) by Janssen – Cilag International N.\n\nFor all those planning to travel amid the COVID-19 pandemic, a new tool developed by VisaGuide.World helps you to verify whether the destination you plan to visit recognises as valid proof of vaccination the vaccine you have been immunised with.", "source": "https://www.ema.europa.eu/en/human-regulatory/overview/public-health-threats/coronavirus-disease-covid-19/treatments-vaccines/vaccines-covid-19/covid-19-vaccines-authorised#authorised-covid-19-vaccines-section", "last_updated": "2022-04-11"}, "entry_info": {"entry_status": "Partially Allowed", "info": "Outdoor events can resume and nightclubs are allowed to reopen at 50 percent capacity indoors and 75 percent capacity outdoors in Yellow zone.\n\nWhite zone has no restrictions.\n\nEvents are ban in Red Zones.", "last_updated": "2022-04-11"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-11"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-11"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-11"}, "tourist_entry": "Partially Allowed"}, "LT": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "Travellers who have been fully vaccinated for COVID-19 are exempted from providing a negative COVID-19 test and self-isolation. A certificate of vaccination is needed.\n\nAccepted vaccines: Janssen, Comirnaty (Pfizer/BioNTech), Moderna and Vaxzevria (AstraZeneca).\n\n*Testing and self-isolation requirements will not apply in the case of of travellers who have visited the Republic of India over the last 14 days before the return to/arrival in the Republic of Lithuania, i.e. they will be required to have a negative test result and to self-isolate;", "source": "https://www.lithuania.travel/en/news/covid-19-in-lithuania-information-for-tourists", "last_updated": "2022-03-30"}, "entry_info": {"entry_status": "Partially Allowed", "info": "Open-air events can admit an unlimited number of people.\n\nIndoor events are limited to 250 people.\n\nIf organisers admit only NIC holders, the audience can be up to 2,000 people.\n\nIn outdoor spaces, a face mask will not be required, as long as there are no other people in close proximity from outside ones household.\n\nUp to ten (or more, if they belong to two households) can meet indoors.\n\nAn unlimited number can meet in outdoor spaces and venues.", "last_updated": "2022-03-30"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-03-30"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-03-30"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-03-30"}, "tourist_entry": "Partially Allowed"}, "LU": {"vaccine_info": {"entry_status": "Allowed", "info": "Fully vaccinated travelers can enter without PCR test.\n\nAll travelers over the age of twelve will need to present a vaccination certificate, negative COVID-19 test or proof of recent recovery in order to enter Luxembourg.\n\nAllowed Vaccines:\n\nAstraZeneca, BioNTech/Pfizer, Johnson&Johnson and Moderna\n\nClick here for detailed information https://europa.eu/youreurope/citizens/travel/travel-and-covid/luxembourg/index_en.htm ", "source": "https://europa.eu/youreurope/citizens/travel/travel-and-covid/luxembourg/index_en.htm", "last_updated": "2022-04-13"}, "entry_info": {"entry_status": "Allowed", "info": "For sports events with up to 10 people there are no restrictions.\n\nFor more than 10 people you must ear a mask, stay 2 metres apart OR use the CovidCheck certificate.\n\nGatherings of 10 - 50 people either need to wear masks and socially distance OR use the CovidCheck certificate.\n\nFor gatherings of 50 - 300 people the requirement is to socially distance and wear a mask and be seated OR use the CovidCheck certificate.\n\nFor events from 300 to a maximum of 2,000 participants special permission from the Health Directorate is required.", "last_updated": "2022-04-13"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-13"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-13"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-13"}, "tourist_entry": "Partially Allowed"}, "LV": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "Persons who can provide a certificate issued in the EU, EEA countries, Switzerland or the United Kingdom, stating that the person has received full vaccination (i.e. 15 days have elapsed since the completion of a full vaccination course or fifteen days after a single dose of vaccine (registered by the European Medicines Agency or equivalent regulators or recognized by the World Health Organization) received no later than 180 days after a laboratory-confirmed episode of SARS-CoV-2 infection as determined by SARS-CoV-2 viral RNA) and what vaccine he/she were vaccinated with (exemption from self-isolation only applies to vaccines registered by the European Medicines Agency or equivalent regulators or recognised by the World Health Organisation);", "source": "https://reopen.europa.eu/en/map/LVA/7001", "last_updated": "2022-04-13"}, "entry_info": {"entry_status": "Banned", "info": "All public events, including meetings, are banned. \n\nNo private gatherings are permitted, with the exceptions of funerals and baptisms. No more than 20 guests may gather for an outdoor funeral ceremony, excluding the service providers. No more than 10 individuals from no more than two households may gather for a baptism, excluding the individuals performing the baptism.  ", "last_updated": "2022-04-13"}, "event_info": {"entry_status": "Delivery/Takeout only", "last_updated": "2022-04-13"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-13"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-13"}, "tourist_entry": "Partially Allowed"}, "MT": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "Travel to Malta with just a negative PCR test result is no longer allowed. Guests, aged 12 and older, can only travel to Malta if they have a vaccination certificate, confirming that the full dosage of a European Medicines Agency (EMA)-approved vaccine (i.e. Comirnaty [Pfizer] – 2 doses, Jannsen [Johnson & Johnson] – 1 dose, Spikevax [Moderna] – 2 doses, Vaxzevria [AstraZeneca] – 2 doses) was received, and issued at least 14 days from the date of the administration of the final dose of the vaccine. A certificate with 2 different EMA-approved vaccines from the below recognised vaccine certificates is accepted as valid.\n\nApproved Vaccine Certificates\n\nThe said vaccine certificate must be one which is recognised by the Superintendent of Public Health, namely:\n\nMaltese Vaccination Certificate\nEU Digital COVID Certificate (Albania, Andorra, Faroe Islands, Iceland, Israel, Liechtenstein, Monaco, Morocco, North Macedonia, Norway, Panama, San Marino, Switzerland, Turkey, Ukraine and Vatican City have joined the EU Digital COVID Certificate framework, and therefore, the vaccination certificates issued by the countries’ health authorities are also being accepted by the Maltese Authorities)\nAlbanian Digital COVID Certificate / Certifikate dixhitale shqiptare COVID\nAustralian Vaccine Certificate verified through the Medicare Express Plus App\nArab Republic of Egypt Vaccine Certificate\nArmenia Covid-19 Vaccination Certificate issued through the United Information System of Electronic Healthcare in the Republic of Armenia\nKingdom of Bahrain Coronavirus (COVID-19) Vaccination Certificate\nGovernment of Bermuda Ministry of Health COVID-19 Vaccination Certificate\nDoha, Qatar Ministry of Public Health COVID-19 Vaccination Certificate\nCanada COVID-19 Provincial Immunisation Records of the following provinces, as verified by the Verifly app: British Columbia, Alberta, Saskatchewan, Ontario, Québec, New Brunswick, Nova Scotia, Prince Edward Island, Newfoundland & Labrador\nDubai Health Authority Vaccination Certificate with a readable QR code\nGibraltar, Jersey and Guernsey Vaccination Certificates\nIraq Covid-19 Vaccination Card issued by Kurdistan Regional Government\nRepublic of Kosovo Ministry of Health Vaccination Card for COVID-19\nKuwait Vaccination Certificate\nLebanon Vaccination Certificate\nMalaysian Covid-19 Digital Vaccination Certificate verified through MySehatara App\nMoldova Vaccination Certificate as issued by the Moldova Ministry of Health\nPalestinian Ministry of Health Vaccination Certificate\nRepublic of Rwanda Covid-19 Vaccination Certificate issued by Rwanda Biomedical Centre (only on presentation of mobile phone number and respective code)\nSaudi Arabia Vaccination Certificate issued by sehhaty.sa\nSerbian Green Certificate with a readable QR code\nSingapore Vaccination Certificate\nSouth Korea Covid-19 Vaccination Certificate issued through the COOV app.\nTurkish Vaccination Certificate with a readable QR code\nUAE Al Hosn Vaccine Certificate\nUnited States CDC COVID-19 Vaccination Record Card with an EMA-approved vaccine, verified digitally through the VeriFLY app.\nUnited Kingdom Vaccination Certificates: \nEngland: NHS Covid Pass (Digital App and NHS Letter)\nWales: NHS Covid Pass Letter\nScotland: NHS Letter demonstrating Covid-19 vaccination status\nNorthern Ireland: Interim proof of vaccination document which is valid until 11:59pm on 31st July 2021\n \n\nThe following certificates are NOT VALID for travel to Malta:\n\nCertificate of recovery from Covid-19 without a vaccine;\nVaccine appointment card;\nVaccine certificates with less than 14 days from the final dose;\nCertificates for vaccines which are not approved by the European Medicines Agency;\nNegative Rapid Antigen Test, whether on EU Digital COVID Certificate or otherwise.", "source": "https://www.maltairport.com/covid19/arrival/#TB", "last_updated": "2022-04-13"}, "entry_info": {"entry_status": "Partially Allowed", "info": "Seated events can increase maximum capacity to 300 people.", "last_updated": "2022-04-13"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-13"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-13"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-13"}, "tourist_entry": "Partially Allowed"}, "NL": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "A coronavirus variant of concern has been discovered in southern Africa. From 12.00 noon on 26 November a ban is in place on passenger flights to the Netherlands, Bonaire, St Eustatius and Saba. Information on this page will be updated as soon as possible.\n\nPeople who are fully vaccinated can travel to the Netherlands, but they must be able to show proof of vaccination. Travellers from very high-risk areas always need to show a negative test result, even if they have proof of vaccination.\n\nValidity of proof of vaccination\nAfter you have been fully vaccinated you will receive proof of vaccination or a vaccination certificate. But it is not valid until:\n\n14 days after receiving the second dose of a two-dose vaccine (BioNTech/Pfizer, Moderna, AstraZeneca)\n\n28 days after receiving the Janssen (Johnson & Johnson) vaccine.\nTravelling to the Netherlands with a vaccination certificate from another EU country\nYou can travel to the Netherlands with a vaccination certificate from another EU country. This can be a digital or paper certificate. The vaccination certificate and the vaccine must meet the EU requirements. \n\nPlease note: the United Kingdom is not a member of the EU. \n\nDigital vaccination certificate\nThe EU has set up the EU Digital COVID Certificates system (DCC). Under this system the COVID certificates issued by each member state are accepted by all the other EU member states. In the Netherlands COVID certificates are issued via the CoronaCheck app and website. Other EU countries have their own certificates.\n\nYour vaccination certificate will only be accepted if it meets the requirements and if you were vaccinated with an approved vaccine.", "source": "https://www.covidpasscertificate.com/covid-vaccines-for-travel-to-europe/", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Allowed", "info": "Allowed", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Fully Open", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}, "PT": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "Britons can now travel to Portugal for non-essential purposes as long as they prove that they have been fully vaccinated against the COVID-19 disease.\n\nTravellers should prove that they have been fully vaccinated with an EU-approved COVID-19 vaccine – AstraZeneca, Pfizer/BioNTech, Moderna, Johnson & Johnson – at least 14 days before their trip.", "source": "https://www.tatnews.org/2021/12/covid-19-vaccine-guide-for-travellers-to-thailand/", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Partially Allowed", "info": "A negative covid result is mandatory.", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}, "RO": {"vaccine_info": {"entry_status": "Allowed", "info": "Travellers who have received their final vaccination for COVID-19 more than 10 days ago, are exempt from quarantine. It is required to show proof of vaccination, including the dates.\n\nYou do not need to have a PCR test to board your flight to Romania.\n\nAllowed Vaccines:\n\nComirnaty – (BioNTech, Pfizer),\nModerna\nVaxzervria – AstraZeneca\nJanssen – Johnson & Johnson\nCovishield (AstraZeneca – Serum Institute of India)", "source": "https://www.covidpasscertificate.com/covid-vaccines-for-travel-to-europe/", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Partially Allowed", "info": "Events are allowed with capacity limit.", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Allowed"}, "SE": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "Fully vaccinated travelers can enter Sweden without a PCR test.\n\nThe following vaccines are approved by authorities in Sweden as proof of immunity;\n\nPfizer/BioNTech (Comirnaty)\nAstraZeneca (Vaxzevria)\nJohnson & Johnson (Janssen)\nModerna (Spikevax)\nAstraZeneca-SK Bio (Vaxzevria)\nAstraZeneca-Serum Institute of India (Covishield)\nSinopharm BIBP\nCoronaVac by Sinovac Life Sciences", "source": "https://www.covidpasscertificate.com/covid-vaccines-for-travel-to-europe/", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Partially Allowed", "info": "Public gatherings and public events for more than 50 people are prohibited.", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}, "SI": {"vaccine_info": {"entry_status": "Partially Allowed", "info": "All vaccinated travellers who fall under one of the following categories are allowed to enter Slovenia free of quarantine requirements:\n\n-The second dose of Comirnaty by BioNTech / Pfizer was inoculated to the traveller at least seven days ago,\n\n-The second dose of COVID-19 Vaccine by Moderna was administered at least 14 days ago,\n\n-The first dose of Vaxzervria (COVID-19 Vaccine) from AstraZeneca was received at least 21 days ago,\n\n-A dose of COVID-19 Vaccine Janssen by Johnson and Johnson / Janssen-Cilag was administered at least 14 days ago,\n\n-The first dose of CoviShield by Serum Institute of India / AstraZeneca was administered at least 21 days ago,\n\n-The second dose of Sputnik V was inoculated to the traveller at least 14 days ago\n\n-The second dose of CoronaVac from Sinovac Biotech was received at least 14 days ago, or\n\n-A second dose of COVID-19 Vaccine by Sinopharm was administered at least 14 days ago.", "source": "https://www.covidpasscertificate.com/covid-vaccines-for-travel-to-europe/", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Allowed", "info": "EU Digital COVID Certificate is required to access.", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Allowed"}, "SK": {"vaccine_info": {"entry_status": "Allowed", "info": "Fully vaccinated people who have received both doses of a two-series vaccine (or a single dose of a one-series vaccine) are considered as low risk. Such persons do not require to enter quarantine or self-isolation measures when entering Slovakia. They are now free from any obligations of RT-PCR or antigen testing.\n\nDefinition of fully vaccinated persons:\n\n-Vaccines with a two-dose schedule: 14 days after the administration (day 15) of the second dose, valid for 1 year;\n-Vaccines with a single dose schedule: 21 days after the administration (day 22) of the vaccine, valid for 1 year;\n-People who have had COVID-19: 14 days after receiving the first dose of the vaccine if it was given within 180 days after having COVID-19, valid for 1 year.\n-Vaccines with a single dose or two-dose schedule: immediately after the administration of the first dose of vaccine – temporarily till 9 August 2021\n\nVaccines Approved for Use in Slovakia:\n-BioNTech, Pfizer vaccine\n-Johnson & Johnson vaccine\n-Moderna vaccine\n-Oxford, AstraZeneca vaccine\n-Sputnik V vaccine", "source": "https://www.covidpasscertificate.com/covid-vaccines-for-travel-to-europe/", "last_updated": "2022-04-12"}, "entry_info": {"entry_status": "Partially Allowed", "info": "Cultural events such as theatre, cinema and concerts are also allowed for vaccinated and recovered with limited capacity,", "last_updated": "2022-04-12"}, "event_info": {"entry_status": "Open with restrictions", "last_updated": "2022-04-12"}, "shopping_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "attractions_info": {"entry_status": "Open", "last_updated": "2022-04-12"}, "tourist_entry": "Partially Allowed"}}
