{
  "KR":{
     "area":{
        "name":"South Korea",
        "iataCode":"KR",
        "areaType":"Country"
     },
     "summary":"<p>Authorities have relied on gathering limits and social distancing measures to contain outbreaks since the start of the pandemic. A new spike in COVID-19 cases led to rises in deaths and those with severe symptoms, and threatened hospital bed and ICU availabilities in late November 2021. While daily new case numbers have reached a record high of over 500,000 in mid-March, reductions in deaths and severe cases have prompted authorities to gradually lift most restrictions. Measures are unlikely to re-tighten in the near-term as the new incoming President Yoon won the recent election while criticising the harshness of previous restrictions.</p>",
     "diseaseRiskLevel":"Medium",
     "diseaseInfection":{
        "date":"2022-05-08",
        "level":"Extreme",
        "rate":1239.41
     },
     "diseaseCases":{
        "date":"2022-05-15",
        "deaths":23744,
        "confirmed":17795357
     },
     "hotspots":"<p>Seoul, Incheon, Gyeonggi province</p>",
     "dataSources":{
        "healthDepartementSiteLink":"http://www.kdca.go.kr/index.es?sid=a3",
        "governmentSiteLink":"http://ncov.mohw.go.kr/en/"
     },
     "areaRestrictions":[
        {
           "date":"2022-05-12",
           "text":"<p>Capacity limits on public gatherings and time restrictions for bars, restaurants and other venues have been lifted. Houses of worship may also operate at full capacity.</p>",
           "restrictionType":"Others"
        }
     ],
     "areaAccessRestriction":{
        "transportation":{
           "date":"2022-05-12",
           "text":"<p>Quarantine-free 'travel bubble flights for group travellers fully vaccinated at least 14 days prior to travel have commenced between <strong>Incheon International Airport (ICN/RKSI)</strong> serving Seoul and <strong>Saipan International Airport (SPN/PGSN)</strong> in the <strong>Northern Mariana Islands</strong> (an unincorporated territory and commonwealth of the United States). Quarantine-free 'travel bubble' flights are also available for fully vaccinated travellers from Singapore; travellers must have tested negative for COVID-19 prior to departure to be eligible. Similar arrangements are being negotiated with <strong>Thailand</strong> and <strong>Guam</strong>, but talks have stalled due to spikes in COVID-19 cases.</p> <p>Jeju Air resumed flights between <strong>Incheon Airport</strong> and Bangkok’s <strong>Suvarnabhumi Airport (BKK/VTBS)</strong> from 22 December.</p> <p>AirAsia, Air India and some other international carriers have suspended commercial flights to and from South Korea until further notice. All Korean Air flights to and from Russia are suspended until further notice.</p>",
           "transportationType":"FLIGHT",
           "isBanned":"Partial",
           "throughDate":"indef"
        },
        "declarationDocuments":{
           "date":"2022-05-12",
           "text":"<p><strong>Health document</strong><br>All permitted inbound travellers must fill out and submit a Health Questionnaire and a Special Quarantine Declaration form while in-flight. Entry can be restricted if the contact information (phone number, address, etc.) on the Special Quarantine Declaration cannot be verified.</p>\n<p>This requirement is waived for those who have completed the <a href=\"https://cov19ent.kdca.go.kr/cpassportal/biz/beffatstmnt/main.do?lang=en\">Quarantine Information Advance Input System</a> prior to travel.</p>\n",
           "documentRequired":"Yes"
        },
        "entry":{
           "date":"2022-05-12",
           "text":"<p>All inbound non-resident foreign nationals must secure a visa prior to their travel. All travellers, including South Korean nationals and residents, must hold a valid negative PCR test result to be allowed to board an inbound flight to South Korea. South Korean nationals who are found after entry with a non-conforming certificate must undergo a five days quarantine in a government-designated facility and an additional two days of home quarantine.</p> <p>Visa-free entry has resumed. Eligible travellers from select countries/regions must apply and obtain a Korea Electronic Travel Authorisation (K-ETA) for receiving a South Korea bound boarding pass. Further information on K-ETA can be found <a href=\"https://www.moj.go.kr/immigration_eng/index.do\" target=\"_blank\" rel=\"noopener\">here</a>.</p>",
           "ban":"No",
           "throughDate":"indef",
           "rules":"http://ncov.mohw.go.kr/duBoardList.do?brdId=2&brdGubun=23",
           "borderBan":[
              {
                 "borderType":"maritimeBorderBan",
                 "status":"Closed"
              },
              {
                 "borderType":"landBorderBan",
                 "status":"Closed"
              }
           ]
        },
        "diseaseTesting":{
           "date":"2022-05-12",
           "text":"<p><strong>Before travel</strong></p><p>All inbound travellers aged six or older, including South Korean nationals, must submit English or Korean certificates of negative results of COVID-19 tests (or English or Korean translations notarised by South Korean Embassies or Consulates) issued in paper. The test must have been taken within 48 hours before departure to be valid. All non-South Korean nationals, as well as South Korean nationals departing from <strong>Indonesia</strong> and\\xa0<strong>Myanmar</strong> without valid negative pre-travel COVID-19 test certificates, have been denied boarding on South Korea bound flights.</p>\n<p>South Korean nationals who recovered from COVID-19 between 10-40 days before departure can be exempted from the pre-travel testing requirement. Documents required for exemption can be found <a href=\"https://www.kdca.go.kr/board/board.es?mid=a20504000000&amp;bid=0014\">here</a>.</p>\n<p>Also, travellers with a humanitarian or urgent reason to enter the country including attending funerals or official business reasons are exempted from the pre-departure testing requirement. Additionally, aircrews, Korean sailors departing from Singapore (must hold a Seafarer&#39;s Book of the Republic of Korea) and those who are refused entrance at their destination are also exempted.</p>\n<p>Travellers departing from the <strong>Philippines</strong> or <strong>Uzbekistan</strong> must conduct their tests at their respective government-designated testing centres that are recognised by the South Korean Embassies or Consulates in those countries. Similar test centre restriction is possible in other departure countries; check the departure country&#39;s South Korean Embassy/Consulate websites for updates.</p>\n<p>South Korean nationals who arrive without a valid negative pre-travel COVID-19 test certificate and test positive for COVID-19 after arrival have been fined up to KRW 2,000,000.</p>\n<p><strong>After arrival</strong></p><p>All arrivals must take a PCR test for COVID-19 within one day of arrival. Long-stay residents, regardless of their vaccination status, must test at their local Public Health Centres, while all other fully vaccinated non-nationals must test at the Incheon Airport COVID-19 Test Centre or medical institution at their own expense. Quarantine exempted diplomatic passport holders and military personnel must test at a government-designated facility. Those who test positive must quarantine based on rules that apply to non-fully vaccinated travellers. </p>\n<p>All arrivals must also take either a rapid antigen test or a PCR test on the sixth or seventh day of arrival. Authorities plan to lift this requirement from 1 June.</p>\n<p>All arrivals must take a PCR test for COVID-19 within one day of arrival. Long-stay residents, regardless of vaccination status, must test at their local Public Health Centres, while all other unvaccinated non-nationals must test at government-designated facilities. Quarantine exempted diplomatic passport holders and military personnel must test at a government-designated facility. Those who test positive must quarantine.</p>\n<p>All arrivals must also take either a rapid antigen test or a PCR test on the sixth or seventh day of arrival. Authorities plan to lift this requirement from 1 June.</p>\n<p>All arrivals must take a PCR test for COVID-19 within one day of arrival. South Korean nationals, regardless of their vaccination status, must test at their local Public Health Centres. Quarantine exempted diplomatic passport holders and military personnel must test at a government-designated facility. Those who test positive must quarantine based on rules that apply to non-fully vaccinated travellers.</p>\n<p>All arrivals must also take either a rapid antigen test or a PCR test on the sixth or seventh day of arrival. Authorities plan to lift this requirement from 1 June.</p>\n<p>All arrivals by sea ports must take a PCR test for COVID-19 on their vessel of arrival or at testing site as designated by authorities within one day of arrival. Those who test positive must quarantine based on rules that apply to non-fully vaccinated travellers. A followup rapid antigen or PCR test must be conducted on day six or seven of arrival.</p>\n<p>All arrivals must also take either a rapid antigen test or a PCR test on the sixth or seventh day of arrival. Authorities plan to lift this requirement from 1 June.</p>\n",
           "isRequired":"Yes",
           "when":"Before travel, After arrival",
           "requirement":"Mandatory",
           "rules":"https://www.0404.go.kr/dev/newest_view.mofa?id=ATC0000000008922&pagenum=1&mst_id=MST0000000000041&ctnm=&div_cd=&st=title&stext=, http://ncov.mohw.go.kr/shBoardView.do?brdId=2&brdGubun=23&ncvContSeq=6333, http://ncov.mohw.go.kr/shBoardView.do?brdId=2&brdGubun=23&ncvContSeq=6413",
           "testType":"PCR, NAAT, LAMP, TMA, SDA, NEAR",
           "minimumAge":6,
           "validityPeriod":{
              "delay":"P48H",
              "referenceDateType":"Departure"
           }
        },
        "tracingApplication":{
           "date":"2022-05-12",
           "text":"<p>Travellers are no longer required to install the \"Self-quarantine Safe Protection\" contact tracing app.</p>",
           "isRequired":"No",
           "iosUrl":[
              "https://apps.apple.com/us/app/%EC%9E%90%EA%B0%80%EA%B2%A9%EB%A6%AC%EC%9E%90-%EC%95%88%EC%A0%84%EB%B3%B4%ED%98%B8/id1502372537"
           ],
           "androidUrl":[
              "https://play.google.com/store/apps/details?id=kr.go.safekorea.sqsm&hl=ko"
           ]
        },
        "quarantineModality":{
           "date":"2022-05-12",
           "text":"<p>All unvaccinated non-South Korean nationals must quarantine for seven days. Long-term residents must do so at their residence, while short-term residents and all other non-nationals must do so at a government-designated facility; long-term residents without a residence suitable for quarantine must quarantine at a government-designated facility. Quarantine at a government-designated facility must be done at the traveller&#39;s own expense (max. KRW 150,000 per day). Travellers must be tested negative for COVID-19 with either a PCR or an antigen test on Day 6 or 7 to exit quarantine requirement; authorities plan to lift the testing requirement to exit quarantine from 1 June.</p>\n<p>Fully vaccinated travellers with an invalid certificate or those who fail to submit their vaccine certificate in the Q-Code portal before departure will be designated as unvaccinated travellers and will be required to quarantine on arrival.</p>\n<p>Those who violate COVID-19 related measures during quarantine must wear an electronic tracking bracelet to ensure compliance with official orders during quarantine, and those who violate quarantine orders can face up to a year in prison or fines of up to KRW 10,000,000.</p>\n<p>Unvaccinated South Korean nationals must quarantine at their residence for seven days. Those without a residence suitable for quarantine must quarantine at a government-designated facility. Quarantine at a government-designated facility must be done at the traveller&#39;s own expense (max. KRW 150,000 per day). Travellers must be tested negative for COVID-19 with either a PCR or an antigen test on Day 6 or 7 to exit quarantine; authorities plan to lift the testing requirement to exit quarantine from 1 June.</p>\n<p>Fully vaccinated travellers with an invalid certificate or those who fail to submit their vaccine certificate in the Q-Code portal before departure will be designated as unvaccinated travellers and will be required to quarantine on arrival.</p>\n<p>Those who violate COVID-19 related measures during quarantine must wear an electronic tracking bracelet to ensure compliance with official orders during quarantine, and those who violate quarantine orders can face up to a year in prison or fines of up to KRW 10,000,000.</p>\n<p>All travellers fully vaccinated against COVID-19, regardless of origin, are eligible for <strong>quarantine exemption</strong>. Those arriving at Incheon, Gimhae or Daegu airports can use the online <a href=\"https://cov19ent.kdca.go.kr/cpassportal/\">Q-CODE system</a> to apply for the exemption before departure. Alternatively, quarantine exemption can be applied through the departure country&#39;s South Korean Embassy/Consulate with the form that can be found\\xa0<a href=\"http://ncov.mohw.go.kr/upload/viewer/skin/doc.html?fn=1649756237903_20220412183717.pdf&amp;rs=/upload/viewer/result/202205/\">here</a>.</p>\n<p>Fully vaccinated travellers with an invalid certificate or those <strong>who fail to submit their vaccine certificate</strong> in the Q-Code portal before departure will be designated as unvaccinated travellers and must quarantine at their residence on arrival for seven days. Those without a residence suitable for quarantine must quarantine at a government-designated facility.</p>\n<p>Fully vaccinated South Korean nationals <strong>who test positive for COVID-19</strong> on their first after-arrival test must contact their local Public Health Centres and quarantine at home or a government-designated facility as directed by authorities. Quarantine at a government-designated facility must be done at the traveller&#39;s own expense (max. KRW 150,000 per day).</p>\n<p>Those who violate COVID-19 related measures during quarantine must wear an electronic tracking bracelet to ensure compliance with official orders during quarantine, and those who violate quarantine orders can face up to a year in prison or fines of up to KRW 10,000,000.</p>\n<p>Fully vaccinated long-term residents <strong>who test positive for COVID-19</strong> on their first after-arrival test must contact their local Public Health Centres and quarantine at home or a government-designated facility as directed by authorities. Quarantine at a government-designated facility must be done at the traveller&#39;s own expense (max. KRW 150,000 per day).</p>\n<p>Those who violate COVID-19 related measures during quarantine must wear an electronic tracking bracelet to ensure compliance with official orders during quarantine, and those who violate quarantine orders can face up to a year in prison or fines of up to KRW 10,000,000.</p>\n",
           "eligiblePerson":"Some travellers",
           "quarantineType":"Hybrid",
           "duration":7,
           "rules":"http://ncov.mohw.go.kr/shBoardView.do?brdId=2&brdGubun=23&ncvContSeq=6413",
           "mandateList":"http://ncov.mohw.go.kr/shBoardView.do?brdId=2&brdGubun=23&ncvContSeq=6268",
           "quarantineOnArrivalAreas":[
              {
                 "iataCode":"AD",
                 "areaType":"country"
              },
              {
                 "iataCode":"AE",
                 "areaType":"country"
              },
              {
                 "iataCode":"AF",
                 "areaType":"country"
              },
              {
                 "iataCode":"AG",
                 "areaType":"country"
              },
              {
                 "iataCode":"AI",
                 "areaType":"country"
              },
              {
                 "iataCode":"AL",
                 "areaType":"country"
              },
              {
                 "iataCode":"AM",
                 "areaType":"country"
              },
              {
                 "iataCode":"AO",
                 "areaType":"country"
              },
              {
                 "iataCode":"AR",
                 "areaType":"country"
              },
              {
                 "iataCode":"AS",
                 "areaType":"country"
              },
              {
                 "iataCode":"AT",
                 "areaType":"country"
              },
              {
                 "iataCode":"AU",
                 "areaType":"country"
              },
              {
                 "iataCode":"AW",
                 "areaType":"country"
              },
              {
                 "iataCode":"AZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"BA",
                 "areaType":"country"
              },
              {
                 "iataCode":"BB",
                 "areaType":"country"
              },
              {
                 "iataCode":"BD",
                 "areaType":"country"
              },
              {
                 "iataCode":"BE",
                 "areaType":"country"
              },
              {
                 "iataCode":"BF",
                 "areaType":"country"
              },
              {
                 "iataCode":"BG",
                 "areaType":"country"
              },
              {
                 "iataCode":"BH",
                 "areaType":"country"
              },
              {
                 "iataCode":"BI",
                 "areaType":"country"
              },
              {
                 "iataCode":"BJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"BL",
                 "areaType":"country"
              },
              {
                 "iataCode":"BM",
                 "areaType":"country"
              },
              {
                 "iataCode":"BN",
                 "areaType":"country"
              },
              {
                 "iataCode":"BO",
                 "areaType":"country"
              },
              {
                 "iataCode":"BQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"BR",
                 "areaType":"country"
              },
              {
                 "iataCode":"BS",
                 "areaType":"country"
              },
              {
                 "iataCode":"BT",
                 "areaType":"country"
              },
              {
                 "iataCode":"BW",
                 "areaType":"country"
              },
              {
                 "iataCode":"BY",
                 "areaType":"country"
              },
              {
                 "iataCode":"BZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"CA",
                 "areaType":"country"
              },
              {
                 "iataCode":"CC",
                 "areaType":"country"
              },
              {
                 "iataCode":"CD",
                 "areaType":"country"
              },
              {
                 "iataCode":"CF",
                 "areaType":"country"
              },
              {
                 "iataCode":"CG",
                 "areaType":"country"
              },
              {
                 "iataCode":"CH",
                 "areaType":"country"
              },
              {
                 "iataCode":"CI",
                 "areaType":"country"
              },
              {
                 "iataCode":"CK",
                 "areaType":"country"
              },
              {
                 "iataCode":"CL",
                 "areaType":"country"
              },
              {
                 "iataCode":"CM",
                 "areaType":"country"
              },
              {
                 "iataCode":"CN",
                 "areaType":"country"
              },
              {
                 "iataCode":"CO",
                 "areaType":"country"
              },
              {
                 "iataCode":"CR",
                 "areaType":"country"
              },
              {
                 "iataCode":"CS",
                 "areaType":"country"
              },
              {
                 "iataCode":"CU",
                 "areaType":"country"
              },
              {
                 "iataCode":"CV",
                 "areaType":"country"
              },
              {
                 "iataCode":"CW",
                 "areaType":"country"
              },
              {
                 "iataCode":"CY",
                 "areaType":"country"
              },
              {
                 "iataCode":"CZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"DE",
                 "areaType":"country"
              },
              {
                 "iataCode":"DJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"DK",
                 "areaType":"country"
              },
              {
                 "iataCode":"DM",
                 "areaType":"country"
              },
              {
                 "iataCode":"DO",
                 "areaType":"country"
              },
              {
                 "iataCode":"DZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"EC",
                 "areaType":"country"
              },
              {
                 "iataCode":"EE",
                 "areaType":"country"
              },
              {
                 "iataCode":"EG",
                 "areaType":"country"
              },
              {
                 "iataCode":"ER",
                 "areaType":"country"
              },
              {
                 "iataCode":"ES",
                 "areaType":"country"
              },
              {
                 "iataCode":"ET",
                 "areaType":"country"
              },
              {
                 "iataCode":"FI",
                 "areaType":"country"
              },
              {
                 "iataCode":"FJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"FM",
                 "areaType":"country"
              },
              {
                 "iataCode":"FO",
                 "areaType":"country"
              },
              {
                 "iataCode":"FR",
                 "areaType":"country"
              },
              {
                 "iataCode":"GA",
                 "areaType":"country"
              },
              {
                 "iataCode":"GB",
                 "areaType":"country"
              },
              {
                 "iataCode":"GD",
                 "areaType":"country"
              },
              {
                 "iataCode":"GE",
                 "areaType":"country"
              },
              {
                 "iataCode":"GF",
                 "areaType":"country"
              },
              {
                 "iataCode":"GG",
                 "areaType":"country"
              },
              {
                 "iataCode":"GH",
                 "areaType":"country"
              },
              {
                 "iataCode":"GI",
                 "areaType":"country"
              },
              {
                 "iataCode":"GL",
                 "areaType":"country"
              },
              {
                 "iataCode":"GM",
                 "areaType":"country"
              },
              {
                 "iataCode":"GN",
                 "areaType":"country"
              },
              {
                 "iataCode":"GP",
                 "areaType":"country"
              },
              {
                 "iataCode":"GQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"GR",
                 "areaType":"country"
              },
              {
                 "iataCode":"GT",
                 "areaType":"country"
              },
              {
                 "iataCode":"GU",
                 "areaType":"country"
              },
              {
                 "iataCode":"GW",
                 "areaType":"country"
              },
              {
                 "iataCode":"GY",
                 "areaType":"country"
              },
              {
                 "iataCode":"HK",
                 "areaType":"country"
              },
              {
                 "iataCode":"HN",
                 "areaType":"country"
              },
              {
                 "iataCode":"HR",
                 "areaType":"country"
              },
              {
                 "iataCode":"HT",
                 "areaType":"country"
              },
              {
                 "iataCode":"HU",
                 "areaType":"country"
              },
              {
                 "iataCode":"ID",
                 "areaType":"country"
              },
              {
                 "iataCode":"IE",
                 "areaType":"country"
              },
              {
                 "iataCode":"IL",
                 "areaType":"country"
              },
              {
                 "iataCode":"IN",
                 "areaType":"country"
              },
              {
                 "iataCode":"IQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"IR",
                 "areaType":"country"
              },
              {
                 "iataCode":"IS",
                 "areaType":"country"
              },
              {
                 "iataCode":"IT",
                 "areaType":"country"
              },
              {
                 "iataCode":"JE",
                 "areaType":"country"
              },
              {
                 "iataCode":"JM",
                 "areaType":"country"
              },
              {
                 "iataCode":"JO",
                 "areaType":"country"
              },
              {
                 "iataCode":"JP",
                 "areaType":"country"
              },
              {
                 "iataCode":"KE",
                 "areaType":"country"
              },
              {
                 "iataCode":"KG",
                 "areaType":"country"
              },
              {
                 "iataCode":"KH",
                 "areaType":"country"
              },
              {
                 "iataCode":"KI",
                 "areaType":"country"
              },
              {
                 "iataCode":"KM",
                 "areaType":"country"
              },
              {
                 "iataCode":"KN",
                 "areaType":"country"
              },
              {
                 "iataCode":"KP",
                 "areaType":"country"
              },
              {
                 "iataCode":"KR",
                 "areaType":"country"
              },
              {
                 "iataCode":"KW",
                 "areaType":"country"
              },
              {
                 "iataCode":"KY",
                 "areaType":"country"
              },
              {
                 "iataCode":"KZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"LA",
                 "areaType":"country"
              },
              {
                 "iataCode":"LB",
                 "areaType":"country"
              },
              {
                 "iataCode":"LC",
                 "areaType":"country"
              },
              {
                 "iataCode":"LI",
                 "areaType":"country"
              },
              {
                 "iataCode":"LK",
                 "areaType":"country"
              },
              {
                 "iataCode":"LR",
                 "areaType":"country"
              },
              {
                 "iataCode":"LS",
                 "areaType":"country"
              },
              {
                 "iataCode":"LT",
                 "areaType":"country"
              },
              {
                 "iataCode":"LU",
                 "areaType":"country"
              },
              {
                 "iataCode":"LV",
                 "areaType":"country"
              },
              {
                 "iataCode":"LY",
                 "areaType":"country"
              },
              {
                 "iataCode":"MA",
                 "areaType":"country"
              },
              {
                 "iataCode":"MC",
                 "areaType":"country"
              },
              {
                 "iataCode":"MD",
                 "areaType":"country"
              },
              {
                 "iataCode":"ME",
                 "areaType":"country"
              },
              {
                 "iataCode":"MF",
                 "areaType":"country"
              },
              {
                 "iataCode":"MG",
                 "areaType":"country"
              },
              {
                 "iataCode":"MH",
                 "areaType":"country"
              },
              {
                 "iataCode":"MK",
                 "areaType":"country"
              },
              {
                 "iataCode":"ML",
                 "areaType":"country"
              },
              {
                 "iataCode":"MM",
                 "areaType":"country"
              },
              {
                 "iataCode":"MN",
                 "areaType":"country"
              },
              {
                 "iataCode":"MO",
                 "areaType":"country"
              },
              {
                 "iataCode":"MQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"MR",
                 "areaType":"country"
              },
              {
                 "iataCode":"MS",
                 "areaType":"country"
              },
              {
                 "iataCode":"MT",
                 "areaType":"country"
              },
              {
                 "iataCode":"MU",
                 "areaType":"country"
              },
              {
                 "iataCode":"MV",
                 "areaType":"country"
              },
              {
                 "iataCode":"MW",
                 "areaType":"country"
              },
              {
                 "iataCode":"MX",
                 "areaType":"country"
              },
              {
                 "iataCode":"MY",
                 "areaType":"country"
              },
              {
                 "iataCode":"MZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"NA",
                 "areaType":"country"
              },
              {
                 "iataCode":"NC",
                 "areaType":"country"
              },
              {
                 "iataCode":"NE",
                 "areaType":"country"
              },
              {
                 "iataCode":"NG",
                 "areaType":"country"
              },
              {
                 "iataCode":"NI",
                 "areaType":"country"
              },
              {
                 "iataCode":"NL",
                 "areaType":"country"
              },
              {
                 "iataCode":"NO",
                 "areaType":"country"
              },
              {
                 "iataCode":"NP",
                 "areaType":"country"
              },
              {
                 "iataCode":"NR",
                 "areaType":"country"
              },
              {
                 "iataCode":"NZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"OM",
                 "areaType":"country"
              },
              {
                 "iataCode":"PA",
                 "areaType":"country"
              },
              {
                 "iataCode":"PE",
                 "areaType":"country"
              },
              {
                 "iataCode":"PF",
                 "areaType":"country"
              },
              {
                 "iataCode":"PG",
                 "areaType":"country"
              },
              {
                 "iataCode":"PH",
                 "areaType":"country"
              },
              {
                 "iataCode":"PK",
                 "areaType":"country"
              },
              {
                 "iataCode":"PL",
                 "areaType":"country"
              },
              {
                 "iataCode":"PR",
                 "areaType":"country"
              },
              {
                 "iataCode":"PS",
                 "areaType":"country"
              },
              {
                 "iataCode":"PT",
                 "areaType":"country"
              },
              {
                 "iataCode":"PW",
                 "areaType":"country"
              },
              {
                 "iataCode":"PY",
                 "areaType":"country"
              },
              {
                 "iataCode":"QA",
                 "areaType":"country"
              },
              {
                 "iataCode":"RE",
                 "areaType":"country"
              },
              {
                 "iataCode":"RO",
                 "areaType":"country"
              },
              {
                 "iataCode":"RS",
                 "areaType":"country"
              },
              {
                 "iataCode":"RU",
                 "areaType":"country"
              },
              {
                 "iataCode":"RW",
                 "areaType":"country"
              },
              {
                 "iataCode":"SA",
                 "areaType":"country"
              },
              {
                 "iataCode":"SB",
                 "areaType":"country"
              },
              {
                 "iataCode":"SC",
                 "areaType":"country"
              },
              {
                 "iataCode":"SD",
                 "areaType":"country"
              },
              {
                 "iataCode":"SE",
                 "areaType":"country"
              },
              {
                 "iataCode":"SG",
                 "areaType":"country"
              },
              {
                 "iataCode":"SI",
                 "areaType":"country"
              },
              {
                 "iataCode":"SJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"SK",
                 "areaType":"country"
              },
              {
                 "iataCode":"SL",
                 "areaType":"country"
              },
              {
                 "iataCode":"SM",
                 "areaType":"country"
              },
              {
                 "iataCode":"SN",
                 "areaType":"country"
              },
              {
                 "iataCode":"SO",
                 "areaType":"country"
              },
              {
                 "iataCode":"SR",
                 "areaType":"country"
              },
              {
                 "iataCode":"SS",
                 "areaType":"country"
              },
              {
                 "iataCode":"ST",
                 "areaType":"country"
              },
              {
                 "iataCode":"SV",
                 "areaType":"country"
              },
              {
                 "iataCode":"SX",
                 "areaType":"country"
              },
              {
                 "iataCode":"SY",
                 "areaType":"country"
              },
              {
                 "iataCode":"SZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"TC",
                 "areaType":"country"
              },
              {
                 "iataCode":"TD",
                 "areaType":"country"
              },
              {
                 "iataCode":"TG",
                 "areaType":"country"
              },
              {
                 "iataCode":"TH",
                 "areaType":"country"
              },
              {
                 "iataCode":"TJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"TL",
                 "areaType":"country"
              },
              {
                 "iataCode":"TM",
                 "areaType":"country"
              },
              {
                 "iataCode":"TN",
                 "areaType":"country"
              },
              {
                 "iataCode":"TO",
                 "areaType":"country"
              },
              {
                 "iataCode":"TR",
                 "areaType":"country"
              },
              {
                 "iataCode":"TT",
                 "areaType":"country"
              },
              {
                 "iataCode":"TV",
                 "areaType":"country"
              },
              {
                 "iataCode":"TW",
                 "areaType":"country"
              },
              {
                 "iataCode":"TZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"UA",
                 "areaType":"country"
              },
              {
                 "iataCode":"UG",
                 "areaType":"country"
              },
              {
                 "iataCode":"US",
                 "areaType":"country"
              },
              {
                 "iataCode":"UY",
                 "areaType":"country"
              },
              {
                 "iataCode":"UZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"VC",
                 "areaType":"country"
              },
              {
                 "iataCode":"VE",
                 "areaType":"country"
              },
              {
                 "iataCode":"VG",
                 "areaType":"country"
              },
              {
                 "iataCode":"VI",
                 "areaType":"country"
              },
              {
                 "iataCode":"VN",
                 "areaType":"country"
              },
              {
                 "iataCode":"VU",
                 "areaType":"country"
              },
              {
                 "iataCode":"WF",
                 "areaType":"country"
              },
              {
                 "iataCode":"WS",
                 "areaType":"country"
              },
              {
                 "iataCode":"YE",
                 "areaType":"country"
              },
              {
                 "iataCode":"ZA",
                 "areaType":"country"
              },
              {
                 "iataCode":"ZM",
                 "areaType":"country"
              },
              {
                 "iataCode":"ZW",
                 "areaType":"country"
              }
           ]
        },
        "mask":{
           "date":"2022-05-12",
           "text":"<p>The wearing of face masks is a mandatory requirement in all indoor areas including on public transportation and outdoor areas where a one-metre distance cannot be maintained between people as well as outdoor gatherings, including sports matches, rallies and events, with 50 or more people.</p> <p>A fine of up to KRW 100,000 have been issued for non-compliance with the face mask mandate. Those under the age of 14 and those unable to wear masks due to medical conditions are exempt.</p>",
           "isRequired":"Partial"
        },
        "exit":{
           "date":"2022-05-12",
           "specialRequirements":"No",
           "isBanned":"No"
        },
        "otherRestriction":{
           "date":"2022-05-12",
           "text":"<p>Travellers waived of quarantine, including those with diplomatic visas A-1, A-2 and A-3 must submit daily health status checks via the ‘Self Diagnosis App’ found <a href=\"http://ncov.mohw.go.kr/selfcheck/\" target=\"_blank\" rel=\"noopener\">here</a>.</p>"
        },
        "diseaseVaccination":{
           "date":"2022-05-12",
           "text":"<p>Travellers who have completed the recommended dose of the vaccine at least 14 days before departure are designated as fully vaccinated. Travellers who acquire their vaccinations outside of South Korea must integrate the proof of vaccination within the <a href=\"https://ncv.kdca.go.kr/menu.es?mid=a12507000000\" target=\"_blank\" rel=\"noopener\">COOV app</a>.</p> <p>All travellers fully vaccinated against COVID-19 are exempt from the seven-day quarantine on arrival, provided these travellers submitted their vaccination records on the <a href=\"https://cov19ent.kdca.go.kr/cpassportal/\" target=\"_blank\" rel=\"noopener\">Q-CODE portal</a>.</p>",
           "isRequired":"No",
           "referenceLink":"http://ncov.mohw.go.kr/upload/viewer/skin/doc.html?fn=1644371353583_20220209104913.hwp&rs=/upload/viewer/result/202203/",
           "acceptedCertificates":[
              "Not Specified",
              " Vietnam certificate"
           ],
           "qualifiedVaccines":[
              "Pfizer - 14 days after second dose.",
              "AstraZeneca (Vaxzevria) - 14 days after second dose.",
              "Vaxevria (South Korea) - 14 days after second dose.",
              "Covishield (India) - 14 days after second dose.",
              "Johnson & Johnson - 14 days after first dose.",
              "Sinopharm (Beijing) - 14 days after second dose.",
              "CoronaVac - 14 days after second dose.",
              "Moderna - 14 days after second dose.",
              "Sinopharm (Wuhan) - 14 days after second dose.",
              "Nuvaxovid (Novavax) - 14 days after second dose."
           ],
           "policy":"Yes",
           "exemptions":"Quarantine"
        }
     },
     "areaPolicy":{
        "date":"2022-05-12",
        "text":"<p>Authorities lifted all remaining restrictions except face mask mandates for indoor venues.</p>",
        "status":"Opening",
        "startDate":"2021-12-18",
        "endDate":"indef",
        "referenceLink":"http://ncov.mohw.go.kr/en/tcmBoardList.do?brdId=12&brdGubun=125&dataGubun=&ncvContSeq=&contSeq=&board_id="
     },
     "relatedArea":[
        {
           "methods":[
              "GET"
           ],
           "rel":"Parent"
        }
     ],
     "areaVaccinated":[
        {
           "date":"2022-05-09",
           "vaccinationDoseStatus":"oneDose",
           "percentage":89.638
        },
        {
           "date":"2022-05-14",
           "vaccinationDoseStatus":"fully",
           "percentage":86.86
        }
     ],
     "type":"covid19-area-report"
  },
  "JP":{
     "area":{
        "name":"Japan",
        "iataCode":"JP",
        "areaType":"Country"
     },
     "summary":"<p>Authorities have mostly relied on social distancing measures and advisories against inter-prefectural travel instead of hard restrictions to try and contain COVID-19 outbreaks since early 2020. Such restrictions were periodically tightened during waves of outbreaks. There are currently no prefectures designated with emergency or quasi-emergency restrictions which regulated the operations of non-essential businesses, including bars and restaurants.</p>",
     "diseaseRiskLevel":"High",
     "diseaseInfection":{
        "date":"2022-05-08",
        "level":"Extreme",
        "rate":346.74,
        "infectionMapLink":"https://www.nytimes.com/interactive/2021/world/japan-covid-cases.html"
     },
     "diseaseCases":{
        "date":"2022-05-15",
        "deaths":30061,
        "confirmed":8369751
     },
     "dataSources":{
        "healthDepartementSiteLink":"https://www.mhlw.go.jp/stf/seisakunitsuite/bunya/0000164708_00079.html",
        "governmentSiteLink":"https://corona.go.jp/en/"
     },
     "areaRestrictions":[
        {
           "date":"2022-05-04",
           "text":"<p>Authorities lifted national and prefectural level mandates on shorter business hours and capacity restrictions, but social distancing measures implemented by lower-level municipalities as well as those self imposed by businesses remain.</p><p><strong>Covid Pass is required for some domestic activities:</strong> In <strong>Tokyo</strong>, officials require eating and drinking establishments to allow seating of five or more patrons per table to only those with proof of vaccination against COVID-19, in order to be officially certified as ‘COVID-19 safe’.</p><p><strong>Covid Pass availability:</strong> Proof of vaccination against COVID-19 can be obtained throught the TOKYO VACTION mobile app, as well as paper certificates issued by municipal offices.</p>",
           "restrictionType":"Others"
        }
     ],
     "areaAccessRestriction":{
        "transportation":{
           "date":"2022-05-12",
           "text":"<p>While there is no explicit flight ban, a majority of commercial international flights in and out of the country remain suspended. Japan Airlines resumed flights at <strong>Tokyo Narita Airport (NRT/RJAA)</strong> in Chiba prefecture, <strong>Tokyo Haneda Airport (HND/RJTT)</strong> and <strong>Nagoya</strong>'s <strong>Chubu Centrair International Airport (NGO/RJGG)</strong> in Aichi prefecture to and from the <strong>United States</strong>, the <strong>United Kingdom</strong>, <strong>France</strong>, <strong>Germany</strong>, <strong>Finland</strong>, <strong>Russia</strong>, <strong>Thailand</strong>, <strong>Singapore</strong>, <strong>Malaysia</strong>, <strong>Indonesia</strong>, <strong>Vietnam</strong>, the <strong>Philippines</strong>, <strong>India</strong>, <strong>Australia</strong>, <strong>China</strong>, <strong>Taiwan</strong> and <strong>South Korea</strong>.</p> <p>AirAsia Japan has permanently ceased all operations, both domestic and international, due to low demand and financial losses amid the pandemic. All Nippon Airways (ANA) has resumed some international flights between <strong>Tokyo Narita (NRT/RJAA)</strong> and select destinations in the <strong>United States</strong>, <strong>United Kingdom</strong>, <strong>India</strong>, <strong>Australia</strong> and several other countries.</p>",
           "transportationType":"FLIGHT",
           "isBanned":"No",
           "throughDate":"indef"
        },
        "declarationDocuments":{
           "date":"2022-05-04",
           "text":"<p><strong>Other document</strong><br>All arriving travellers must submit a written pledge to quarantine for 14 days, refrain from using public transportation for 14 days, install a COVID-19 Contact-Confirming Application, retain location information and provide it to the health centres or other institutions if requested. Travellers must have a smartphone with a mobile number operable in Japan for this purpose. Those who do not submit the pledge have been requested to quarantine at government-designated facilities for their quarantine.</p>\n<p><strong>Other document</strong><br>All inbound travellers must complete and submit a questionnaire before departure to be allowed entry.</p>\n<p><strong>Health document</strong><br>Airline passengers must complete a health declaration prior to disembarkation.</p>\n",
           "documentRequired":"Yes"
        },
        "entry":{
           "date":"2022-05-04",
           "text":"<p>Japanese nationals are allowed entry. Foreigners with Japanese residency and a valid re-entry permit are allowed to re-enter. Non-Japanese nationals are allowed to enter as students, or for business or employment purposes under the supervision of their receiving organisations based in Japan, which applies for either short-term stay (less than three months) or long-term stay. Entry for tourism purposes is not allowed and foreign nationals have been denied permission to enter Japan from 56 countries, including <strong>Russia</strong> and <strong>South Africa</strong>.</p> <p>Passenger ferries departing from <strong>China</strong> and <strong>South Korea</strong> to Japan have been suspended.</p> <p>All visas already issued under “Business Track”, “Residence Track”, or “New measures for border enforcement (4)” have been suspended. Many visa exemption measures and previously issued entry visas have also been suspended. The validity of all visas issued - except for the status of residence of “Spouse or Child of a Japanese National”, “Spouse or Child of a Permanent Resident” or “Diplomat” - have been suspended.</p> <p>Check <a href=\"https://www.mofa.go.jp/ca/fna/page4e_001053.html\" target=\"_blank\" rel=\"noopener\">here</a> for details on restricted entry and suspended visas.</p> <p><strong>Fast Track</strong></p> <p>A Fast Track pre-registration for entry procedures is available for travellers arriving at Tokyo Narita, Tokyo Haneda, Chubu Centair, Kansai and Fukuoka airports through the MySoS app. The pre-registration must be completed at least six hours prior to arrival to be eligible. Details can be found <a href=\"https://www.hco.mhlw.go.jp/fasttrack/en/\" target=\"_blank\" rel=\"noopener\">here</a>.</p>",
           "ban":"Partial",
           "throughDate":"indef",
           "rules":"https://www.mofa.go.jp/ca/fna/page4e_001053.html",
           "exemptions":"https://www.isa.go.jp/en/hisho06_00099.html",
           "bannedArea":[
              {
                 "iataCode":"AF",
                 "areaType":"country"
              },
              {
                 "iataCode":"AM",
                 "areaType":"country"
              },
              {
                 "iataCode":"AO",
                 "areaType":"country"
              },
              {
                 "iataCode":"BA",
                 "areaType":"country"
              },
              {
                 "iataCode":"BG",
                 "areaType":"country"
              },
              {
                 "iataCode":"BY",
                 "areaType":"country"
              },
              {
                 "iataCode":"CD",
                 "areaType":"country"
              },
              {
                 "iataCode":"CF",
                 "areaType":"country"
              },
              {
                 "iataCode":"CG",
                 "areaType":"country"
              },
              {
                 "iataCode":"CI",
                 "areaType":"country"
              },
              {
                 "iataCode":"DJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"DZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"EE",
                 "areaType":"country"
              },
              {
                 "iataCode":"EG",
                 "areaType":"country"
              },
              {
                 "iataCode":"ET",
                 "areaType":"country"
              },
              {
                 "iataCode":"GA",
                 "areaType":"country"
              },
              {
                 "iataCode":"GD",
                 "areaType":"country"
              },
              {
                 "iataCode":"GH",
                 "areaType":"country"
              },
              {
                 "iataCode":"GM",
                 "areaType":"country"
              },
              {
                 "iataCode":"GN",
                 "areaType":"country"
              },
              {
                 "iataCode":"GQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"GT",
                 "areaType":"country"
              },
              {
                 "iataCode":"GW",
                 "areaType":"country"
              },
              {
                 "iataCode":"HT",
                 "areaType":"country"
              },
              {
                 "iataCode":"IQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"JM",
                 "areaType":"country"
              },
              {
                 "iataCode":"KE",
                 "areaType":"country"
              },
              {
                 "iataCode":"KG",
                 "areaType":"country"
              },
              {
                 "iataCode":"KM",
                 "areaType":"country"
              },
              {
                 "iataCode":"LB",
                 "areaType":"country"
              },
              {
                 "iataCode":"LC",
                 "areaType":"country"
              },
              {
                 "iataCode":"LR",
                 "areaType":"country"
              },
              {
                 "iataCode":"LS",
                 "areaType":"country"
              },
              {
                 "iataCode":"LY",
                 "areaType":"country"
              },
              {
                 "iataCode":"MD",
                 "areaType":"country"
              },
              {
                 "iataCode":"MG",
                 "areaType":"country"
              },
              {
                 "iataCode":"ML",
                 "areaType":"country"
              },
              {
                 "iataCode":"MR",
                 "areaType":"country"
              },
              {
                 "iataCode":"MW",
                 "areaType":"country"
              },
              {
                 "iataCode":"NA",
                 "areaType":"country"
              },
              {
                 "iataCode":"NG",
                 "areaType":"country"
              },
              {
                 "iataCode":"PS",
                 "areaType":"country"
              },
              {
                 "iataCode":"RU",
                 "areaType":"country"
              },
              {
                 "iataCode":"SD",
                 "areaType":"country"
              },
              {
                 "iataCode":"SK",
                 "areaType":"country"
              },
              {
                 "iataCode":"SL",
                 "areaType":"country"
              },
              {
                 "iataCode":"SN",
                 "areaType":"country"
              },
              {
                 "iataCode":"SO",
                 "areaType":"country"
              },
              {
                 "iataCode":"SS",
                 "areaType":"country"
              },
              {
                 "iataCode":"ST",
                 "areaType":"country"
              },
              {
                 "iataCode":"SZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"UA",
                 "areaType":"country"
              },
              {
                 "iataCode":"VC",
                 "areaType":"country"
              },
              {
                 "iataCode":"ZA",
                 "areaType":"country"
              },
              {
                 "iataCode":"ZM",
                 "areaType":"country"
              },
              {
                 "iataCode":"ZW",
                 "areaType":"country"
              }
           ],
           "borderBan":[
              {
                 "borderType":"maritimeBorderBan"
              }
           ]
        },
        "diseaseTesting":{
           "date":"2022-05-04",
           "text":"<p><strong>Before travel</strong></p><p>All inbound travellers, including Japanese nationals, must present a negative pre-travel COVID-19 certificate from a test taken within 72 hours of departure. Those without a negative pre-travel COVID-19 certificate, have been denied entry. Certificate formats can be found <a href=\"https://www.mhlw.go.jp/stf/seisakunitsuite/bunya/0000121431_00248.html\">here</a>.</p>\n<p><strong>Upon arrival</strong></p><p>All arrivals must test for COVID-19 upon arrival and wait at the airport until the test result is available.</p>\n<p><strong>After arrival</strong></p><p>All foreign nationals must be tested on day 3 of quarantine after arrival. Fully vaccinated travellers from countries not designated as areas where B.1.1.529 Omicron variant has become dominant and have received the third dose are not required to undergo an after arrival testing.</p>\n",
           "isRequired":"Yes",
           "when":"Before travel, Upon arrival, After arrival",
           "requirement":"Mandatory",
           "rules":"https://www.mofa.go.jp/ca/fna/page25e_000334.html",
           "testType":"PCR, NAAT, LAMP, TMA, TRC, NEAR, SmartAMP, NGS, CLEIA",
           "minimumAge":0,
           "validityPeriod":{
              "delay":"P72H",
              "referenceDateType":"Departure"
           }
        },
        "tracingApplication":{
           "date":"2022-05-04",
           "text":"<p>All travellers must also install the <strong>MySOS</strong> app for contact and compliance confirmation purposes by authorities.</p>",
           "isRequired":"Yes",
           "iosUrl":[
              "https://apps.apple.com/jp/app/mysos/id971663851"
           ],
           "androidUrl":[
              "https://play.google.com/store/apps/details?id=net.allm.mysos&hl=en&gl=US"
           ]
        },
        "quarantineModality":{
           "date":"2022-05-04",
           "text":"<p>Travellers from &quot;non-designated countries/regions&quot;, without a valid vaccination certificate indicating the completion of a booster shot must quarantine at home for three days and submit a negative result of a COVID-19 test taken on the third day of quarantine to the Health Monitoring Center for Overseas Entrants. Those who do not take a test must quarantine for seven days after arrival.</p>\n<p>Travellers from &quot;non-designated countries&quot; with a valid vaccination certificate indicating the completion of a booster shot are not required to quarantine.</p>\n<p>Travellers entering from &quot;designated countries/regions&quot;, which includes <strong>Russia</strong>, <strong>South Korea</strong>, <strong>Egypt</strong>, <strong>Pakistan</strong>, <strong>Bulgaria</strong>, <strong>South Africa</strong> and <strong>Laos</strong>, without a valid vaccination certificate indicating the completion of a booster must quarantine at government-designated facilities for three days if they test negative on Day 3; those who do not obtain a negative result must quarantine for seven days.</p>\n<p>Travellers entering from &quot;designated countries/regions&quot;, which includes <strong>Russia</strong>, <strong>South Korea</strong>, <strong>Egypt</strong>, <strong>Pakistan</strong>, <strong>Bulgaria</strong>, <strong>South Africa</strong> and <strong>Laos</strong>, with a valid vaccination certificate indicating the completion of a booster shot must quarantine at home for at least three days. Those who submit a negative result of a COVID-19 test taken on the third day of quarantine to the Health Monitoring Center for Overseas Entrants can end quarantine. Those who do not take a Day 3 COVID-19 test must quarantine for seven days upon arrival at home or place of residence.</p>\n",
           "eligiblePerson":"Some travellers",
           "quarantineType":"Self",
           "duration":7,
           "rules":"https://www.mhlw.go.jp/stf/covid-19/bordercontrol.html#h2_8",
           "mandateList":"https://www.mofa.go.jp/ca/fna/page4e_001053.html",
           "quarantineOnArrivalAreas":[
              {
                 "iataCode":"AF",
                 "areaType":"country"
              },
              {
                 "iataCode":"AL",
                 "areaType":"country"
              },
              {
                 "iataCode":"DZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"AD",
                 "areaType":"country"
              },
              {
                 "iataCode":"AO",
                 "areaType":"country"
              },
              {
                 "iataCode":"AG",
                 "areaType":"country"
              },
              {
                 "iataCode":"AR",
                 "areaType":"country"
              },
              {
                 "iataCode":"AM",
                 "areaType":"country"
              },
              {
                 "iataCode":"AW",
                 "areaType":"country"
              },
              {
                 "iataCode":"AU",
                 "areaType":"country"
              },
              {
                 "iataCode":"AT",
                 "areaType":"country"
              },
              {
                 "iataCode":"AZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"BS",
                 "areaType":"country"
              },
              {
                 "iataCode":"BH",
                 "areaType":"country"
              },
              {
                 "iataCode":"BD",
                 "areaType":"country"
              },
              {
                 "iataCode":"BB",
                 "areaType":"country"
              },
              {
                 "iataCode":"BY",
                 "areaType":"country"
              },
              {
                 "iataCode":"BE",
                 "areaType":"country"
              },
              {
                 "iataCode":"BZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"BJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"BM",
                 "areaType":"country"
              },
              {
                 "iataCode":"BT",
                 "areaType":"country"
              },
              {
                 "iataCode":"BO",
                 "areaType":"country"
              },
              {
                 "iataCode":"BQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"BA",
                 "areaType":"country"
              },
              {
                 "iataCode":"BW",
                 "areaType":"country"
              },
              {
                 "iataCode":"BR",
                 "areaType":"country"
              },
              {
                 "iataCode":"VG",
                 "areaType":"country"
              },
              {
                 "iataCode":"BN",
                 "areaType":"country"
              },
              {
                 "iataCode":"BF",
                 "areaType":"country"
              },
              {
                 "iataCode":"BI",
                 "areaType":"country"
              },
              {
                 "iataCode":"KH",
                 "areaType":"country"
              },
              {
                 "iataCode":"CM",
                 "areaType":"country"
              },
              {
                 "iataCode":"CA",
                 "areaType":"country"
              },
              {
                 "iataCode":"CV",
                 "areaType":"country"
              },
              {
                 "iataCode":"KY",
                 "areaType":"country"
              },
              {
                 "iataCode":"CF",
                 "areaType":"country"
              },
              {
                 "iataCode":"TD",
                 "areaType":"country"
              },
              {
                 "iataCode":"CL",
                 "areaType":"country"
              },
              {
                 "iataCode":"CN",
                 "areaType":"country"
              },
              {
                 "iataCode":"CC",
                 "areaType":"country"
              },
              {
                 "iataCode":"CO",
                 "areaType":"country"
              },
              {
                 "iataCode":"KM",
                 "areaType":"country"
              },
              {
                 "iataCode":"CG",
                 "areaType":"country"
              },
              {
                 "iataCode":"CK",
                 "areaType":"country"
              },
              {
                 "iataCode":"CR",
                 "areaType":"country"
              },
              {
                 "iataCode":"CI",
                 "areaType":"country"
              },
              {
                 "iataCode":"HR",
                 "areaType":"country"
              },
              {
                 "iataCode":"CU",
                 "areaType":"country"
              },
              {
                 "iataCode":"CW",
                 "areaType":"country"
              },
              {
                 "iataCode":"CY",
                 "areaType":"country"
              },
              {
                 "iataCode":"CZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"CD",
                 "areaType":"country"
              },
              {
                 "iataCode":"DK",
                 "areaType":"country"
              },
              {
                 "iataCode":"DJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"DM",
                 "areaType":"country"
              },
              {
                 "iataCode":"DO",
                 "areaType":"country"
              },
              {
                 "iataCode":"TL",
                 "areaType":"country"
              },
              {
                 "iataCode":"EC",
                 "areaType":"country"
              },
              {
                 "iataCode":"SV",
                 "areaType":"country"
              },
              {
                 "iataCode":"GQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"ER",
                 "areaType":"country"
              },
              {
                 "iataCode":"EE",
                 "areaType":"country"
              },
              {
                 "iataCode":"ET",
                 "areaType":"country"
              },
              {
                 "iataCode":"FO",
                 "areaType":"country"
              },
              {
                 "iataCode":"FJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"FI",
                 "areaType":"country"
              },
              {
                 "iataCode":"FR",
                 "areaType":"country"
              },
              {
                 "iataCode":"GF",
                 "areaType":"country"
              },
              {
                 "iataCode":"GA",
                 "areaType":"country"
              },
              {
                 "iataCode":"GM",
                 "areaType":"country"
              },
              {
                 "iataCode":"GE",
                 "areaType":"country"
              },
              {
                 "iataCode":"DE",
                 "areaType":"country"
              },
              {
                 "iataCode":"GH",
                 "areaType":"country"
              },
              {
                 "iataCode":"GI",
                 "areaType":"country"
              },
              {
                 "iataCode":"GR",
                 "areaType":"country"
              },
              {
                 "iataCode":"GL",
                 "areaType":"country"
              },
              {
                 "iataCode":"GD",
                 "areaType":"country"
              },
              {
                 "iataCode":"GP",
                 "areaType":"country"
              },
              {
                 "iataCode":"GU",
                 "areaType":"country"
              },
              {
                 "iataCode":"GT",
                 "areaType":"country"
              },
              {
                 "iataCode":"GN",
                 "areaType":"country"
              },
              {
                 "iataCode":"GW",
                 "areaType":"country"
              },
              {
                 "iataCode":"GY",
                 "areaType":"country"
              },
              {
                 "iataCode":"HT",
                 "areaType":"country"
              },
              {
                 "iataCode":"HN",
                 "areaType":"country"
              },
              {
                 "iataCode":"HK",
                 "areaType":"country"
              },
              {
                 "iataCode":"HU",
                 "areaType":"country"
              },
              {
                 "iataCode":"IS",
                 "areaType":"country"
              },
              {
                 "iataCode":"IN",
                 "areaType":"country"
              },
              {
                 "iataCode":"ID",
                 "areaType":"country"
              },
              {
                 "iataCode":"IR",
                 "areaType":"country"
              },
              {
                 "iataCode":"IQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"IE",
                 "areaType":"country"
              },
              {
                 "iataCode":"IL",
                 "areaType":"country"
              },
              {
                 "iataCode":"IT",
                 "areaType":"country"
              },
              {
                 "iataCode":"JM",
                 "areaType":"country"
              },
              {
                 "iataCode":"JO",
                 "areaType":"country"
              },
              {
                 "iataCode":"KZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"KE",
                 "areaType":"country"
              },
              {
                 "iataCode":"KI",
                 "areaType":"country"
              },
              {
                 "iataCode":"CS",
                 "areaType":"country"
              },
              {
                 "iataCode":"KW",
                 "areaType":"country"
              },
              {
                 "iataCode":"KG",
                 "areaType":"country"
              },
              {
                 "iataCode":"LV",
                 "areaType":"country"
              },
              {
                 "iataCode":"LB",
                 "areaType":"country"
              },
              {
                 "iataCode":"LS",
                 "areaType":"country"
              },
              {
                 "iataCode":"LR",
                 "areaType":"country"
              },
              {
                 "iataCode":"LY",
                 "areaType":"country"
              },
              {
                 "iataCode":"LI",
                 "areaType":"country"
              },
              {
                 "iataCode":"LT",
                 "areaType":"country"
              },
              {
                 "iataCode":"LU",
                 "areaType":"country"
              },
              {
                 "iataCode":"MO",
                 "areaType":"country"
              },
              {
                 "iataCode":"MK",
                 "areaType":"country"
              },
              {
                 "iataCode":"MG",
                 "areaType":"country"
              },
              {
                 "iataCode":"MW",
                 "areaType":"country"
              },
              {
                 "iataCode":"MY",
                 "areaType":"country"
              },
              {
                 "iataCode":"MV",
                 "areaType":"country"
              },
              {
                 "iataCode":"ML",
                 "areaType":"country"
              },
              {
                 "iataCode":"MT",
                 "areaType":"country"
              },
              {
                 "iataCode":"MH",
                 "areaType":"country"
              },
              {
                 "iataCode":"MQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"MR",
                 "areaType":"country"
              },
              {
                 "iataCode":"MU",
                 "areaType":"country"
              },
              {
                 "iataCode":"MX",
                 "areaType":"country"
              },
              {
                 "iataCode":"FM",
                 "areaType":"country"
              },
              {
                 "iataCode":"MD",
                 "areaType":"country"
              },
              {
                 "iataCode":"MC",
                 "areaType":"country"
              },
              {
                 "iataCode":"MN",
                 "areaType":"country"
              },
              {
                 "iataCode":"ME",
                 "areaType":"country"
              },
              {
                 "iataCode":"MA",
                 "areaType":"country"
              },
              {
                 "iataCode":"MZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"MM",
                 "areaType":"country"
              },
              {
                 "iataCode":"NA",
                 "areaType":"country"
              },
              {
                 "iataCode":"NR",
                 "areaType":"country"
              },
              {
                 "iataCode":"NP",
                 "areaType":"country"
              },
              {
                 "iataCode":"NL",
                 "areaType":"country"
              },
              {
                 "iataCode":"NC",
                 "areaType":"country"
              },
              {
                 "iataCode":"NZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"NI",
                 "areaType":"country"
              },
              {
                 "iataCode":"NE",
                 "areaType":"country"
              },
              {
                 "iataCode":"NG",
                 "areaType":"country"
              },
              {
                 "iataCode":"KP",
                 "areaType":"country"
              },
              {
                 "iataCode":"NO",
                 "areaType":"country"
              },
              {
                 "iataCode":"OM",
                 "areaType":"country"
              },
              {
                 "iataCode":"PW",
                 "areaType":"country"
              },
              {
                 "iataCode":"PA",
                 "areaType":"country"
              },
              {
                 "iataCode":"PG",
                 "areaType":"country"
              },
              {
                 "iataCode":"PY",
                 "areaType":"country"
              },
              {
                 "iataCode":"PE",
                 "areaType":"country"
              },
              {
                 "iataCode":"PH",
                 "areaType":"country"
              },
              {
                 "iataCode":"PL",
                 "areaType":"country"
              },
              {
                 "iataCode":"PT",
                 "areaType":"country"
              },
              {
                 "iataCode":"PR",
                 "areaType":"country"
              },
              {
                 "iataCode":"QA",
                 "areaType":"country"
              },
              {
                 "iataCode":"RE",
                 "areaType":"country"
              },
              {
                 "iataCode":"RO",
                 "areaType":"country"
              },
              {
                 "iataCode":"RW",
                 "areaType":"country"
              },
              {
                 "iataCode":"WS",
                 "areaType":"country"
              },
              {
                 "iataCode":"SM",
                 "areaType":"country"
              },
              {
                 "iataCode":"ST",
                 "areaType":"country"
              },
              {
                 "iataCode":"SA",
                 "areaType":"country"
              },
              {
                 "iataCode":"SN",
                 "areaType":"country"
              },
              {
                 "iataCode":"RS",
                 "areaType":"country"
              },
              {
                 "iataCode":"SC",
                 "areaType":"country"
              },
              {
                 "iataCode":"SL",
                 "areaType":"country"
              },
              {
                 "iataCode":"SG",
                 "areaType":"country"
              },
              {
                 "iataCode":"SX",
                 "areaType":"country"
              },
              {
                 "iataCode":"SK",
                 "areaType":"country"
              },
              {
                 "iataCode":"SI",
                 "areaType":"country"
              },
              {
                 "iataCode":"SB",
                 "areaType":"country"
              },
              {
                 "iataCode":"SO",
                 "areaType":"country"
              },
              {
                 "iataCode":"SS",
                 "areaType":"country"
              },
              {
                 "iataCode":"ES",
                 "areaType":"country"
              },
              {
                 "iataCode":"LK",
                 "areaType":"country"
              },
              {
                 "iataCode":"KN",
                 "areaType":"country"
              },
              {
                 "iataCode":"LC",
                 "areaType":"country"
              },
              {
                 "iataCode":"VC",
                 "areaType":"country"
              },
              {
                 "iataCode":"SD",
                 "areaType":"country"
              },
              {
                 "iataCode":"SR",
                 "areaType":"country"
              },
              {
                 "iataCode":"SJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"SZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"SE",
                 "areaType":"country"
              },
              {
                 "iataCode":"CH",
                 "areaType":"country"
              },
              {
                 "iataCode":"SY",
                 "areaType":"country"
              },
              {
                 "iataCode":"TW",
                 "areaType":"country"
              },
              {
                 "iataCode":"TJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"TZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"TH",
                 "areaType":"country"
              },
              {
                 "iataCode":"TG",
                 "areaType":"country"
              },
              {
                 "iataCode":"TO",
                 "areaType":"country"
              },
              {
                 "iataCode":"TT",
                 "areaType":"country"
              },
              {
                 "iataCode":"TN",
                 "areaType":"country"
              },
              {
                 "iataCode":"TR",
                 "areaType":"country"
              },
              {
                 "iataCode":"TM",
                 "areaType":"country"
              },
              {
                 "iataCode":"TC",
                 "areaType":"country"
              },
              {
                 "iataCode":"TV",
                 "areaType":"country"
              },
              {
                 "iataCode":"UG",
                 "areaType":"country"
              },
              {
                 "iataCode":"UA",
                 "areaType":"country"
              },
              {
                 "iataCode":"AE",
                 "areaType":"country"
              },
              {
                 "iataCode":"GB",
                 "areaType":"country"
              },
              {
                 "iataCode":"US",
                 "areaType":"country"
              },
              {
                 "iataCode":"UY",
                 "areaType":"country"
              },
              {
                 "iataCode":"VI",
                 "areaType":"country"
              },
              {
                 "iataCode":"UZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"VU",
                 "areaType":"country"
              },
              {
                 "iataCode":"VE",
                 "areaType":"country"
              },
              {
                 "iataCode":"VN",
                 "areaType":"country"
              },
              {
                 "iataCode":"PS",
                 "areaType":"country"
              },
              {
                 "iataCode":"YE",
                 "areaType":"country"
              },
              {
                 "iataCode":"ZM",
                 "areaType":"country"
              },
              {
                 "iataCode":"ZW",
                 "areaType":"country"
              },
              {
                 "iataCode":"AS",
                 "areaType":"country"
              },
              {
                 "iataCode":"PF",
                 "areaType":"country"
              },
              {
                 "iataCode":"WF",
                 "areaType":"country"
              },
              {
                 "iataCode":"MF",
                 "areaType":"country"
              },
              {
                 "iataCode":"BL",
                 "areaType":"country"
              },
              {
                 "iataCode":"GG",
                 "areaType":"country"
              },
              {
                 "iataCode":"JE",
                 "areaType":"country"
              },
              {
                 "iataCode":"AI",
                 "areaType":"country"
              },
              {
                 "iataCode":"MS",
                 "areaType":"country"
              },
              {
                 "iataCode":"BG",
                 "areaType":"country"
              },
              {
                 "iataCode":"EG",
                 "areaType":"country"
              },
              {
                 "iataCode":"LA",
                 "areaType":"country"
              },
              {
                 "iataCode":"PK",
                 "areaType":"country"
              },
              {
                 "iataCode":"RU",
                 "areaType":"country"
              },
              {
                 "iataCode":"ZA",
                 "areaType":"country"
              },
              {
                 "iataCode":"KR",
                 "areaType":"country"
              }
           ]
        },
        "mask":{
           "date":"2022-05-04",
           "text":"<p>People have been urged to wear face masks in public areas. Many indoor venues voluntarily require patrons to wear a face mask for entry.</p>",
           "isRequired":"Recommended"
        },
        "exit":{
           "date":"2022-05-04",
           "specialRequirements":"No",
           "isBanned":"No"
        },
        "otherRestriction":{
           "date":"2022-05-04",
           "text":"<p>Flights from <strong>China</strong> and <strong>South Korea</strong> have been restricted to <strong>Tokyo Narita Airport (NRT/RJAA)</strong> and <strong>Osaka Kansai Airport (KIX/RJBB)</strong>.</p>"
        },
        "diseaseVaccination":{
           "date":"2022-05-04",
           "text":"<p>Although possessing a vaccination certificate does not guarantee eased quarantine or other measures, authorities have still listed some criteria for vaccination certificates that will be considered valid for travel into Japan. The certificates must contain key personal information and name or manufacturer of the recognised vaccines, must be issued by an official body, and the person must be inoculated with two doses at least 14 days prior. However, individuals only need one dose of the Janssen vaccine to be considered fully inoculated. The certificates will be recognised as valid irrespective of issuing country or region.</p> <p>Authorities mentioned that the third dose or the booster dose can be received regardless of the type of vaccine in the first or second dose. Currently, only the Pfizer’s, Moderna's and Novavax's vaccines have received pharmaceutical approval as a COVID-19 booster dose in Japan.</p>",
           "isRequired":"No",
           "referenceLink":"https://www.mofa.go.jp/ca/fna/page24e_000317.html",
           "acceptedCertificates":[
              "Vietnam certificate",
              " Japan certificate"
           ],
           "qualifiedVaccines":[
              "Pfizer - 14 days after second dose.",
              "AstraZeneca (Vaxzevria) - 14 days after second dose.",
              "Covishield (India) - 14 days after second dose.",
              "Johnson & Johnson - 14 days after first dose.",
              "Moderna - 14 days after second dose.",
              "Covaxin - 14 days after second dose.",
              "Nuvaxovid (Novavax) - 14 days after second dose.",
              "Covovax (Novavax) - 14 days after second dose."
           ],
           "policy":"No"
        }
     },
     "areaPolicy":{
        "date":"2022-05-04",
        "text":"<p>Social distancing measures apply while most economic activities have resumed. Foreign tourists are banned from entry, while entry is allowed for student, business and other visa holders.</p>",
        "status":"Distancing",
        "startDate":"2020-03-25",
        "endDate":"indef",
        "referenceLink":"https://corona.go.jp/en/"
     },
     "relatedArea":[
        {
           "methods":[
              "GET"
           ],
           "rel":"Parent"
        }
     ],
     "areaVaccinated":[
        {
           "date":"2022-04-27",
           "vaccinationDoseStatus":"oneDose",
           "percentage":81.559
        },
        {
           "date":"2022-05-12",
           "vaccinationDoseStatus":"fully",
           "percentage":80.71
        }
     ],
     "type":"covid19-area-report"
  },
  "PH":{
     "area":{
        "name":"Philippines",
        "iataCode":"PH",
        "areaType":"Country"
     },
     "summary":"<p>Authorities in the Philippines have relied on strict lockdown and inter-district travel restrictions in urban areas to tackle the COVID-19 outbreak. The country's healthcare system is not equipped to handle a widespread outbreak and there was a lag in rolling out testing kits at hospitals. An eased internal gathering restrictions are likely to continue in the near-term in some areas. Much of the country has seen a significant decline for the number of active cases.</p>",
     "diseaseRiskLevel":"Medium",
     "diseaseInfection":{
        "date":"2022-05-08",
        "level":"Moderate",
        "rate":2.3
     },
     "diseaseCases":{
        "date":"2022-05-15",
        "deaths":60455,
        "confirmed":3688132
     },
     "hotspots":"<p>Quezon city, Cavite, Laguna, Manila city, Rizal</p>",
     "dataSources":{
        "covidDashboardLink":"https://doh.gov.ph/2019-nCoV",
        "healthDepartementSiteLink":"https://doh.gov.ph/COVID-19-policies"
     },
     "areaRestrictions":[
        {
           "date":"2022-05-05",
           "text":"<p>Nightly curfew is imposed for minors in Metro Manila from 22:00-04:00 local time.</p> <p>Nightly curfew is imposed in parts of Malay in Aklan from 01:00-04:00 local time. Boracay islands no longer imposes curfew measures.</p> <p>Nightly curfew is imposed in Cagayan de Oro, Misamis Oriental province, from 23:00-04:00 local time.</p>",
           "restrictionType":"Curfew"
        },
        {
           "date":"2022-05-05",
           "text":"<p>Public buses between the Metro Manila region and Ilocos Norte province resumed, including to Laoag and Pagudpud, since early 2021; bus operators were not allowed to make unscheduled stops to pick up or drop off passengers along the route. Travellers were asked to purchase their tickets 48 hours prior to their trip, and will be asked to provide health and travel documents.</p> <p>Authorities mandated that non-exempt travellers must have received the final dose of a vaccine against COVID-19 at least 15 days prior to arrival to be allowed entry into Masbate province. Some unvaccinated travellers were allowed to enter as exceptions on humanitarian grounds after conducting COVID-19 tests.</p> <p>Domestic travellers to Cebu are required to present vaccinations cards or certificates. Unvaccinated domestic travellers needed to show a negative RT-PCR, antigen, or saliva swab test result.</p> <p>Zambales provincial authorities lifted COVID-19 testing requirements for inbound tourists who are fully vaccinated against COVID-19. Nevertheless, those exhibiting COVID-19 symptoms must undergo an antigen test at the border before entry.</p>",
           "restrictionType":"Domestic Travel"
        },
        {
           "date":"2022-05-16",
           "text":"<p>Officials have implemented a new COVID-19 alert system ranging from Levels 1 to 5 for areas based on their rates of infection (with Level 5 areas with the highest cases placed under Enhanced Community Quarantine restrictions).</p> <p><strong>Level 4</strong></p> <p>Under Level 4, cinemas and gatherings of non-household members are banned, and non-essential activities are limited to fully vaccinated individuals with 10 percent of indoor venue capacity and 30 percent of outdoor venue capacity. Currently, there are no areas under Level 4.</p> <p><strong>Level 3</strong></p> <p>Under Level 3, non-essential activities are limited to fully vaccinated individuals or non-vaccinated minors below 18 years of age with 30 percent of indoor venue capacity and 50 percent of outdoor venue capacity, while many entertainment and sporting venues and closed and household gathetings are banned. Detailed rules can be found <a href=\"https://doh.gov.ph/node/33589\" target=\"_blank\" rel=\"noopener\">here</a>. Currently, there are no areas under Level 3.</p> <p><strong>Level 2</strong></p> <p>Under Level 2, all indoor venues are allowed to operate at 50 percent capacity for fully vaccinated persons while outdoor venues to 70 percent, regardless of vaccination status.</p> <p>Until 31 May, Level 2 COVID-19 measures are imposed across Benguet, Ifugao, Quezon, Occidental Mindoro, Palawan, Camarines Norte, Camarines Sur, Masbate, Sorsogon, Antique, Negros Occidental, Negros Oriental, Bohol, Cebu, Leyte, Northern Samar, Western Samar, Zamboanga del Sur, Zamboanga del Norte, Zamboanga Sibugay, Lanao del Norte, Davao del Norte, Davao del Sur, Davao Oriental, Davao de Oro, Davao Occidental, Cotabato, Sarangani, Sultan Kudarat, South Cotabato, Agusan del Norte, Agusan del Sur, Dinagat Islands, Surigao del Norte, Basilan, Lanao del Sur, Maguindanao, Sulu and Tawi-Tawi provinces as well as sabela, General Santos and Cotabato.</p> <p><strong>Level 1</strong></p> <p>Under Level 1, all kinds of venues and public transport are allowed to operate without capacity restrictions. However, officials may impose localised measures on interzonal domestic travel.</p> <p>Level 1 measure is imposed in Lapu-Lapu in Cebu province until further notice.</p> <p>Until 31 May, Level 1 measures are imposed in Abra, Apayao, Kalinga, Mountain, Ilocos Norte, Ilocos Sur, La Union, Pangasinan, Batanes, Cagayan, Isabela, Nueva Vizcaya, Quirino, Aurora, Bataan, Bulacan, Nueva Ecija, Pampanga, Tarlac, Zambales, Batangas, Cavite, Laguna, Rizal, Marinduque, Oriental Mindoro, Romblon, Albay and Catanduanes provinces as well as Baguio, Dagupan, Santiago, Angeles, Olongapo, Lucena, Puerto Princesa and Naga.</p> <p>Authorities announced that on-site employees in both private and public sectors are required to be fully vaccinated from 1 December 2021. Unvaccinated employees will not be terminated but will have to undergo regular PCR or antigen testing at their own expense.</p><p><strong>Covid Pass is required for some domestic activities:</strong> In areas with Levels 2, 3 and 4 restrictions, most non-essential businesses are only open to fully vaccinated travellers.</p> <p>Visitors and residents to the province must provide proof of being fully vaccinated against COVID-19 and their identity cards to be allowed entry to the Aurora province.</p> <p>In Cebu, COVID-19 vaccination cards are required for entry into shopping malls and other indoor establishments as well as to use overseas transport. Unvaccinated children under the age of 12 were banned from non-essential travel.</p><p><strong>Covid Pass availability:</strong> A vaccine certificate is issued at the time of vaccination. </p>",
           "restrictionType":"Others"
        }
     ],
     "areaAccessRestriction":{
        "transportation":{
           "date":"2022-05-05",
           "text":"<p>Philippine Airlines, AirAsia Philippines and Cebu Pacific Air have resumed limited international flights at Manila's Ninoy Aquino International Airport (MNL/RPLL). Cebu Pacific Air resumed international routes between Manila's Ninoy Aquino Airport with Bangkok's Suvarnabhumi Airport (BKK/VTBS) in Thailand, Fukuoka Airport (FUK/RJFF) in Japan, and Jakarta’s Soekarno-Hatta Airport (CGK/WIII) in Indonesia.</p> <p>Authorities increase the capacity limit for inbound passengers from 3,000 to 5,000 per day at Manila's Ninoy Aquino International Airport.</p> <p>Cebu Pacific flights between Manila's Ninoy Aquino Airport (MNL/RPLL) and Hong Kong Airport (HKG/VHHH) have resumed.</p>",
           "transportationType":"FLIGHT",
           "isBanned":"Partial",
           "throughDate":"indef"
        },
        "declarationDocuments":{
           "date":"2022-05-05",
           "text":"<p><strong>Health document</strong><br>All travellers must register to the Bureau of Quarantine to attain the e-Health Declaration Card (e-HDC) 24 hours prior to arrival. Failure to produce the One Health Pass QR code upon check-in will be denied embarkation. Foreign diplomats are not required to apply for the pass.</p>\n<p><strong>Travel (PLF) document</strong><br>All passengers must also carry the printed ‘Affidavit of Undertaking’.</p>\n<p><strong>Health Insurance document</strong><br>Foreign nationals must have travel insurance including COVID-19 treatment covering at least USD35,000. Filipino nationals, foreign diplomats and those holding Ukraine passports are exempt.</p>\n",
           "documentRequired":"Yes",
           "healthDocumentationLink":"https://www.onehealthpass.com.ph/e-HDC/",
           "travelDocumentationLink":"https://www.philippineairlines.com/en/~/media/files/DownloadableForms/2021/UNDERTAKING_5-2021-v1.pdf?la=en"
        },
        "entry":{
           "date":"2022-05-05",
           "text":"<p>Fully vaccinated tourists, returning citizens and their family members, foreign diplomatic officials and investors are allowed entry to the Philippines. Only foreign nationals who are fully vaccinated against COVID-19 at least two weeks prior to arrival are permitted entry. Unvaccinated foreign nationals are denied entry, excluding diplomats or those aged 12 and under.</p> <p>Visa-free entry have resumed for fully vaccinated travellers with valid certificates from countries listed <a href=\"https://www.philippineairlines.com/en/~/media/files/coronavirus/travelrulesandrestrictions/arrivingintheph/eo408.pdf?la=en\" target=\"_blank\" rel=\"noopener\">here</a>.</p> <p>All foreign nationals must provide proof of a valid return ticket to the original port of origin or next port of destination for not more than 30 days from the date of arrival. Foreign nationals eligible under the Balikbayan privilege, including those with familial ties or those who are former Filipino nationals are exempt from this requirement. Citizens of <strong>Brazil</strong> and <strong>Israel</strong> are allowed to provide a valid return ticket not older than 59 days after arrival, while holders of <strong>Hong Kong</strong> and <strong>Macau</strong> passports must provide a valid return ticket not older than 14 days.</p> <p>In Luzon region travel is permitted to the nearest international airport within 24 hours of scheduled departure only with proof of international travel documents. Outbound travellers are required to have confirmed tickets, visas and travel health insurance.</p>",
           "ban":"Partial",
           "throughDate":"indef",
           "rules":"https://www.philippineairlines.com/en/covid-19/arrivingintheph",
           "exemptions":"http://www.philippine-embassy.org.sg/consular/visa/general-information/",
           "bannedArea":[
              {
                 "iataCode":"AD",
                 "areaType":"country"
              },
              {
                 "iataCode":"AE",
                 "areaType":"country"
              },
              {
                 "iataCode":"AF",
                 "areaType":"country"
              },
              {
                 "iataCode":"AG",
                 "areaType":"country"
              },
              {
                 "iataCode":"AI",
                 "areaType":"country"
              },
              {
                 "iataCode":"AL",
                 "areaType":"country"
              },
              {
                 "iataCode":"AM",
                 "areaType":"country"
              },
              {
                 "iataCode":"AO",
                 "areaType":"country"
              },
              {
                 "iataCode":"AR",
                 "areaType":"country"
              },
              {
                 "iataCode":"AS",
                 "areaType":"country"
              },
              {
                 "iataCode":"AT",
                 "areaType":"country"
              },
              {
                 "iataCode":"AU",
                 "areaType":"country"
              },
              {
                 "iataCode":"AW",
                 "areaType":"country"
              },
              {
                 "iataCode":"AZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"BA",
                 "areaType":"country"
              },
              {
                 "iataCode":"BB",
                 "areaType":"country"
              },
              {
                 "iataCode":"BD",
                 "areaType":"country"
              },
              {
                 "iataCode":"BE",
                 "areaType":"country"
              },
              {
                 "iataCode":"BF",
                 "areaType":"country"
              },
              {
                 "iataCode":"BG",
                 "areaType":"country"
              },
              {
                 "iataCode":"BH",
                 "areaType":"country"
              },
              {
                 "iataCode":"BI",
                 "areaType":"country"
              },
              {
                 "iataCode":"BJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"BL",
                 "areaType":"country"
              },
              {
                 "iataCode":"BM",
                 "areaType":"country"
              },
              {
                 "iataCode":"BN",
                 "areaType":"country"
              },
              {
                 "iataCode":"BO",
                 "areaType":"country"
              },
              {
                 "iataCode":"BQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"BR",
                 "areaType":"country"
              },
              {
                 "iataCode":"BS",
                 "areaType":"country"
              },
              {
                 "iataCode":"BT",
                 "areaType":"country"
              },
              {
                 "iataCode":"BW",
                 "areaType":"country"
              },
              {
                 "iataCode":"BY",
                 "areaType":"country"
              },
              {
                 "iataCode":"BZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"CA",
                 "areaType":"country"
              },
              {
                 "iataCode":"CC",
                 "areaType":"country"
              },
              {
                 "iataCode":"CD",
                 "areaType":"country"
              },
              {
                 "iataCode":"CF",
                 "areaType":"country"
              },
              {
                 "iataCode":"CG",
                 "areaType":"country"
              },
              {
                 "iataCode":"CH",
                 "areaType":"country"
              },
              {
                 "iataCode":"CI",
                 "areaType":"country"
              },
              {
                 "iataCode":"CK",
                 "areaType":"country"
              },
              {
                 "iataCode":"CL",
                 "areaType":"country"
              },
              {
                 "iataCode":"CM",
                 "areaType":"country"
              },
              {
                 "iataCode":"CN",
                 "areaType":"country"
              },
              {
                 "iataCode":"CO",
                 "areaType":"country"
              },
              {
                 "iataCode":"CR",
                 "areaType":"country"
              },
              {
                 "iataCode":"CS",
                 "areaType":"country"
              },
              {
                 "iataCode":"CU",
                 "areaType":"country"
              },
              {
                 "iataCode":"CV",
                 "areaType":"country"
              },
              {
                 "iataCode":"CW",
                 "areaType":"country"
              },
              {
                 "iataCode":"CY",
                 "areaType":"country"
              },
              {
                 "iataCode":"CZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"DE",
                 "areaType":"country"
              },
              {
                 "iataCode":"DJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"DK",
                 "areaType":"country"
              },
              {
                 "iataCode":"DM",
                 "areaType":"country"
              },
              {
                 "iataCode":"DO",
                 "areaType":"country"
              },
              {
                 "iataCode":"DZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"EC",
                 "areaType":"country"
              },
              {
                 "iataCode":"EE",
                 "areaType":"country"
              },
              {
                 "iataCode":"EG",
                 "areaType":"country"
              },
              {
                 "iataCode":"ER",
                 "areaType":"country"
              },
              {
                 "iataCode":"ES",
                 "areaType":"country"
              },
              {
                 "iataCode":"ET",
                 "areaType":"country"
              },
              {
                 "iataCode":"FI",
                 "areaType":"country"
              },
              {
                 "iataCode":"FJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"FM",
                 "areaType":"country"
              },
              {
                 "iataCode":"FO",
                 "areaType":"country"
              },
              {
                 "iataCode":"FR",
                 "areaType":"country"
              },
              {
                 "iataCode":"GA",
                 "areaType":"country"
              },
              {
                 "iataCode":"GB",
                 "areaType":"country"
              },
              {
                 "iataCode":"GD",
                 "areaType":"country"
              },
              {
                 "iataCode":"GE",
                 "areaType":"country"
              },
              {
                 "iataCode":"GF",
                 "areaType":"country"
              },
              {
                 "iataCode":"GG",
                 "areaType":"country"
              },
              {
                 "iataCode":"GH",
                 "areaType":"country"
              },
              {
                 "iataCode":"GI",
                 "areaType":"country"
              },
              {
                 "iataCode":"GL",
                 "areaType":"country"
              },
              {
                 "iataCode":"GM",
                 "areaType":"country"
              },
              {
                 "iataCode":"GN",
                 "areaType":"country"
              },
              {
                 "iataCode":"GP",
                 "areaType":"country"
              },
              {
                 "iataCode":"GQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"GR",
                 "areaType":"country"
              },
              {
                 "iataCode":"GT",
                 "areaType":"country"
              },
              {
                 "iataCode":"GU",
                 "areaType":"country"
              },
              {
                 "iataCode":"GW",
                 "areaType":"country"
              },
              {
                 "iataCode":"GY",
                 "areaType":"country"
              },
              {
                 "iataCode":"HK",
                 "areaType":"country"
              },
              {
                 "iataCode":"HN",
                 "areaType":"country"
              },
              {
                 "iataCode":"HR",
                 "areaType":"country"
              },
              {
                 "iataCode":"HT",
                 "areaType":"country"
              },
              {
                 "iataCode":"HU",
                 "areaType":"country"
              },
              {
                 "iataCode":"ID",
                 "areaType":"country"
              },
              {
                 "iataCode":"IE",
                 "areaType":"country"
              },
              {
                 "iataCode":"IL",
                 "areaType":"country"
              },
              {
                 "iataCode":"IN",
                 "areaType":"country"
              },
              {
                 "iataCode":"IQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"IR",
                 "areaType":"country"
              },
              {
                 "iataCode":"IS",
                 "areaType":"country"
              },
              {
                 "iataCode":"IT",
                 "areaType":"country"
              },
              {
                 "iataCode":"JE",
                 "areaType":"country"
              },
              {
                 "iataCode":"JM",
                 "areaType":"country"
              },
              {
                 "iataCode":"JO",
                 "areaType":"country"
              },
              {
                 "iataCode":"JP",
                 "areaType":"country"
              },
              {
                 "iataCode":"KE",
                 "areaType":"country"
              },
              {
                 "iataCode":"KG",
                 "areaType":"country"
              },
              {
                 "iataCode":"KH",
                 "areaType":"country"
              },
              {
                 "iataCode":"KI",
                 "areaType":"country"
              },
              {
                 "iataCode":"KM",
                 "areaType":"country"
              },
              {
                 "iataCode":"KN",
                 "areaType":"country"
              },
              {
                 "iataCode":"KP",
                 "areaType":"country"
              },
              {
                 "iataCode":"KR",
                 "areaType":"country"
              },
              {
                 "iataCode":"KW",
                 "areaType":"country"
              },
              {
                 "iataCode":"KY",
                 "areaType":"country"
              },
              {
                 "iataCode":"KZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"LA",
                 "areaType":"country"
              },
              {
                 "iataCode":"LB",
                 "areaType":"country"
              },
              {
                 "iataCode":"LC",
                 "areaType":"country"
              },
              {
                 "iataCode":"LI",
                 "areaType":"country"
              },
              {
                 "iataCode":"LK",
                 "areaType":"country"
              },
              {
                 "iataCode":"LR",
                 "areaType":"country"
              },
              {
                 "iataCode":"LS",
                 "areaType":"country"
              },
              {
                 "iataCode":"LT",
                 "areaType":"country"
              },
              {
                 "iataCode":"LU",
                 "areaType":"country"
              },
              {
                 "iataCode":"LV",
                 "areaType":"country"
              },
              {
                 "iataCode":"LY",
                 "areaType":"country"
              },
              {
                 "iataCode":"MA",
                 "areaType":"country"
              },
              {
                 "iataCode":"MC",
                 "areaType":"country"
              },
              {
                 "iataCode":"MD",
                 "areaType":"country"
              },
              {
                 "iataCode":"ME",
                 "areaType":"country"
              },
              {
                 "iataCode":"MF",
                 "areaType":"country"
              },
              {
                 "iataCode":"MG",
                 "areaType":"country"
              },
              {
                 "iataCode":"MH",
                 "areaType":"country"
              },
              {
                 "iataCode":"MK",
                 "areaType":"country"
              },
              {
                 "iataCode":"ML",
                 "areaType":"country"
              },
              {
                 "iataCode":"MM",
                 "areaType":"country"
              },
              {
                 "iataCode":"MN",
                 "areaType":"country"
              },
              {
                 "iataCode":"MO",
                 "areaType":"country"
              },
              {
                 "iataCode":"MQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"MR",
                 "areaType":"country"
              },
              {
                 "iataCode":"MS",
                 "areaType":"country"
              },
              {
                 "iataCode":"MT",
                 "areaType":"country"
              },
              {
                 "iataCode":"MU",
                 "areaType":"country"
              },
              {
                 "iataCode":"MV",
                 "areaType":"country"
              },
              {
                 "iataCode":"MW",
                 "areaType":"country"
              },
              {
                 "iataCode":"MX",
                 "areaType":"country"
              },
              {
                 "iataCode":"MY",
                 "areaType":"country"
              },
              {
                 "iataCode":"MZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"NA",
                 "areaType":"country"
              },
              {
                 "iataCode":"NC",
                 "areaType":"country"
              },
              {
                 "iataCode":"NE",
                 "areaType":"country"
              },
              {
                 "iataCode":"NG",
                 "areaType":"country"
              },
              {
                 "iataCode":"NI",
                 "areaType":"country"
              },
              {
                 "iataCode":"NL",
                 "areaType":"country"
              },
              {
                 "iataCode":"NO",
                 "areaType":"country"
              },
              {
                 "iataCode":"NP",
                 "areaType":"country"
              },
              {
                 "iataCode":"NR",
                 "areaType":"country"
              },
              {
                 "iataCode":"NZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"OM",
                 "areaType":"country"
              },
              {
                 "iataCode":"PA",
                 "areaType":"country"
              },
              {
                 "iataCode":"PE",
                 "areaType":"country"
              },
              {
                 "iataCode":"PF",
                 "areaType":"country"
              },
              {
                 "iataCode":"PG",
                 "areaType":"country"
              },
              {
                 "iataCode":"PK",
                 "areaType":"country"
              },
              {
                 "iataCode":"PL",
                 "areaType":"country"
              },
              {
                 "iataCode":"PR",
                 "areaType":"country"
              },
              {
                 "iataCode":"PS",
                 "areaType":"country"
              },
              {
                 "iataCode":"PT",
                 "areaType":"country"
              },
              {
                 "iataCode":"PW",
                 "areaType":"country"
              },
              {
                 "iataCode":"PY",
                 "areaType":"country"
              },
              {
                 "iataCode":"QA",
                 "areaType":"country"
              },
              {
                 "iataCode":"RE",
                 "areaType":"country"
              },
              {
                 "iataCode":"RO",
                 "areaType":"country"
              },
              {
                 "iataCode":"RS",
                 "areaType":"country"
              },
              {
                 "iataCode":"RU",
                 "areaType":"country"
              },
              {
                 "iataCode":"RW",
                 "areaType":"country"
              },
              {
                 "iataCode":"SA",
                 "areaType":"country"
              },
              {
                 "iataCode":"SB",
                 "areaType":"country"
              },
              {
                 "iataCode":"SC",
                 "areaType":"country"
              },
              {
                 "iataCode":"SD",
                 "areaType":"country"
              },
              {
                 "iataCode":"SE",
                 "areaType":"country"
              },
              {
                 "iataCode":"SG",
                 "areaType":"country"
              },
              {
                 "iataCode":"SI",
                 "areaType":"country"
              },
              {
                 "iataCode":"SJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"SK",
                 "areaType":"country"
              },
              {
                 "iataCode":"SL",
                 "areaType":"country"
              },
              {
                 "iataCode":"SM",
                 "areaType":"country"
              },
              {
                 "iataCode":"SN",
                 "areaType":"country"
              },
              {
                 "iataCode":"SO",
                 "areaType":"country"
              },
              {
                 "iataCode":"SR",
                 "areaType":"country"
              },
              {
                 "iataCode":"SS",
                 "areaType":"country"
              },
              {
                 "iataCode":"ST",
                 "areaType":"country"
              },
              {
                 "iataCode":"SV",
                 "areaType":"country"
              },
              {
                 "iataCode":"SX",
                 "areaType":"country"
              },
              {
                 "iataCode":"SY",
                 "areaType":"country"
              },
              {
                 "iataCode":"SZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"TC",
                 "areaType":"country"
              },
              {
                 "iataCode":"TD",
                 "areaType":"country"
              },
              {
                 "iataCode":"TG",
                 "areaType":"country"
              },
              {
                 "iataCode":"TH",
                 "areaType":"country"
              },
              {
                 "iataCode":"TJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"TL",
                 "areaType":"country"
              },
              {
                 "iataCode":"TM",
                 "areaType":"country"
              },
              {
                 "iataCode":"TN",
                 "areaType":"country"
              },
              {
                 "iataCode":"TO",
                 "areaType":"country"
              },
              {
                 "iataCode":"TR",
                 "areaType":"country"
              },
              {
                 "iataCode":"TT",
                 "areaType":"country"
              },
              {
                 "iataCode":"TV",
                 "areaType":"country"
              },
              {
                 "iataCode":"TW",
                 "areaType":"country"
              },
              {
                 "iataCode":"TZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"UA",
                 "areaType":"country"
              },
              {
                 "iataCode":"UG",
                 "areaType":"country"
              },
              {
                 "iataCode":"US",
                 "areaType":"country"
              },
              {
                 "iataCode":"UY",
                 "areaType":"country"
              },
              {
                 "iataCode":"UZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"VC",
                 "areaType":"country"
              },
              {
                 "iataCode":"VE",
                 "areaType":"country"
              },
              {
                 "iataCode":"VG",
                 "areaType":"country"
              },
              {
                 "iataCode":"VI",
                 "areaType":"country"
              },
              {
                 "iataCode":"VN",
                 "areaType":"country"
              },
              {
                 "iataCode":"VU",
                 "areaType":"country"
              },
              {
                 "iataCode":"WF",
                 "areaType":"country"
              },
              {
                 "iataCode":"WS",
                 "areaType":"country"
              },
              {
                 "iataCode":"YE",
                 "areaType":"country"
              },
              {
                 "iataCode":"ZA",
                 "areaType":"country"
              },
              {
                 "iataCode":"ZM",
                 "areaType":"country"
              },
              {
                 "iataCode":"ZW",
                 "areaType":"country"
              }
           ],
           "borderBan":[
              {
                 "borderType":"maritimeBorderBan",
                 "status":"Partially Open"
              },
              {
                 "borderType":"landBorderBan",
                 "status":"Partially Open"
              }
           ]
        },
        "diseaseTesting":{
           "date":"2022-05-05",
           "text":"<p><strong>Before travel</strong></p><p>All permitted travellers must produce a negative PCR test result issued 48 hours before departure. Alternatively, travellers are allowed to present a negative antigen laboratory-based test result taken within 24 hours prior to departure.</p>\n<p><strong>After arrival</strong></p><p>Filipino nationals, those with dual citizenship and foreign diplomats who are unvaccinated, partially vaccinated or those with invalid vaccine certificates must be tested on day 5 of the quarantine period.</p>\n<p>Fully vaccinated Filipino and foreign nationals are exempt from quarantine and testing requirements on arrival.</p>\n",
           "isRequired":"Yes",
           "when":"Before travel, After arrival",
           "requirement":"Mandatory",
           "rules":"https://www.philippineairlines.com/en/ph/home/covid-19/arrivingintheph",
           "testType":"PCR, Antigen",
           "minimumAge":3,
           "validityPeriod":{
              "delay":"P48H",
              "referenceDateType":"Departure"
           }
        },
        "tracingApplication":{
           "date":"2022-05-05",
           "text":"<p>Inbound passengers headed for several major airports including Ninoy Aquino International Airport (MNL/RPLL) are required to download the \"Traze Contact Tracing\" application prior to entry to the country (<a href=\"https://www.traze.ph\" target=\"_blank\" rel=\"noopener\">https://www.traze.ph</a>).</p> <p>\"Stay Safe\" is an optional contact tracing mobile app which can be downloaded from <a href=\"https://www.staysafe.ph/\" target=\"_blank\" rel=\"noopener\">https://www.staysafe.ph/</a>.</p>",
           "isRequired":"Yes",
           "iosUrl":[
              "https://www.traze.ph/download-app-store"
           ],
           "androidUrl":[
              "https://www.traze.ph/download-galaxy-store"
           ]
        },
        "quarantineModality":{
           "date":"2022-05-05",
           "text":"<p>Travellers who are unvaccinated, partially vaccinated or those with invalid vaccine certificates must undergo facility-based quarantine until a negative after-arrival test result from day 5 is available. The list of government-approved hotels or accomodattion for quarantine can be found <a href=\"https://quarantine.doh.gov.ph/boq-allowed-and-dot-accredited-quarantine-facilities-as-of-april-29-2022/\">here</a>. These travellers are then required to self-monitor for any signs of symptoms until the 14th day of arrival.</p>\n<p>Fully vaccinated Filipino nationals are not required to undergo quarantine. Fully vaccinated foreign nationals (inluding those from visa-free countries and tourists) are also permitted entry without undergoing quarantine.</p>\n<p>Foreign diplomats, foreign dignitaries and those entering the country for official purposes who are unvaccinated, partially vaccinated or those with invalid vaccine certificates must undergo home-based quarantine or at a declared accomodation until a negative after-arrival test result from day 5 is available. These travellers are then required to self-monitor for any symptoms at their place of residence until their 14th day from date of arrival.</p>\n",
           "eligiblePerson":"Some travellers",
           "quarantineType":"Self",
           "duration":5,
           "rules":"https://www.philippineairlines.com/en/covid-19/arrivingintheph",
           "quarantineOnArrivalAreas":[
              {
                 "iataCode":"AD",
                 "areaType":"country"
              },
              {
                 "iataCode":"AE",
                 "areaType":"country"
              },
              {
                 "iataCode":"AF",
                 "areaType":"country"
              },
              {
                 "iataCode":"AG",
                 "areaType":"country"
              },
              {
                 "iataCode":"AI",
                 "areaType":"country"
              },
              {
                 "iataCode":"AL",
                 "areaType":"country"
              },
              {
                 "iataCode":"AM",
                 "areaType":"country"
              },
              {
                 "iataCode":"AO",
                 "areaType":"country"
              },
              {
                 "iataCode":"AR",
                 "areaType":"country"
              },
              {
                 "iataCode":"AS",
                 "areaType":"country"
              },
              {
                 "iataCode":"AT",
                 "areaType":"country"
              },
              {
                 "iataCode":"AU",
                 "areaType":"country"
              },
              {
                 "iataCode":"AW",
                 "areaType":"country"
              },
              {
                 "iataCode":"AZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"BA",
                 "areaType":"country"
              },
              {
                 "iataCode":"BB",
                 "areaType":"country"
              },
              {
                 "iataCode":"BD",
                 "areaType":"country"
              },
              {
                 "iataCode":"BE",
                 "areaType":"country"
              },
              {
                 "iataCode":"BF",
                 "areaType":"country"
              },
              {
                 "iataCode":"BG",
                 "areaType":"country"
              },
              {
                 "iataCode":"BH",
                 "areaType":"country"
              },
              {
                 "iataCode":"BI",
                 "areaType":"country"
              },
              {
                 "iataCode":"BJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"BL",
                 "areaType":"country"
              },
              {
                 "iataCode":"BM",
                 "areaType":"country"
              },
              {
                 "iataCode":"BN",
                 "areaType":"country"
              },
              {
                 "iataCode":"BO",
                 "areaType":"country"
              },
              {
                 "iataCode":"BQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"BR",
                 "areaType":"country"
              },
              {
                 "iataCode":"BS",
                 "areaType":"country"
              },
              {
                 "iataCode":"BT",
                 "areaType":"country"
              },
              {
                 "iataCode":"BW",
                 "areaType":"country"
              },
              {
                 "iataCode":"BY",
                 "areaType":"country"
              },
              {
                 "iataCode":"BZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"CA",
                 "areaType":"country"
              },
              {
                 "iataCode":"CC",
                 "areaType":"country"
              },
              {
                 "iataCode":"CD",
                 "areaType":"country"
              },
              {
                 "iataCode":"CF",
                 "areaType":"country"
              },
              {
                 "iataCode":"CG",
                 "areaType":"country"
              },
              {
                 "iataCode":"CH",
                 "areaType":"country"
              },
              {
                 "iataCode":"CI",
                 "areaType":"country"
              },
              {
                 "iataCode":"CK",
                 "areaType":"country"
              },
              {
                 "iataCode":"CL",
                 "areaType":"country"
              },
              {
                 "iataCode":"CM",
                 "areaType":"country"
              },
              {
                 "iataCode":"CN",
                 "areaType":"country"
              },
              {
                 "iataCode":"CO",
                 "areaType":"country"
              },
              {
                 "iataCode":"CR",
                 "areaType":"country"
              },
              {
                 "iataCode":"CS",
                 "areaType":"country"
              },
              {
                 "iataCode":"CU",
                 "areaType":"country"
              },
              {
                 "iataCode":"CV",
                 "areaType":"country"
              },
              {
                 "iataCode":"CW",
                 "areaType":"country"
              },
              {
                 "iataCode":"CY",
                 "areaType":"country"
              },
              {
                 "iataCode":"CZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"DE",
                 "areaType":"country"
              },
              {
                 "iataCode":"DJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"DK",
                 "areaType":"country"
              },
              {
                 "iataCode":"DM",
                 "areaType":"country"
              },
              {
                 "iataCode":"DO",
                 "areaType":"country"
              },
              {
                 "iataCode":"DZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"EC",
                 "areaType":"country"
              },
              {
                 "iataCode":"EE",
                 "areaType":"country"
              },
              {
                 "iataCode":"EG",
                 "areaType":"country"
              },
              {
                 "iataCode":"ER",
                 "areaType":"country"
              },
              {
                 "iataCode":"ES",
                 "areaType":"country"
              },
              {
                 "iataCode":"ET",
                 "areaType":"country"
              },
              {
                 "iataCode":"FI",
                 "areaType":"country"
              },
              {
                 "iataCode":"FJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"FM",
                 "areaType":"country"
              },
              {
                 "iataCode":"FO",
                 "areaType":"country"
              },
              {
                 "iataCode":"FR",
                 "areaType":"country"
              },
              {
                 "iataCode":"GA",
                 "areaType":"country"
              },
              {
                 "iataCode":"GB",
                 "areaType":"country"
              },
              {
                 "iataCode":"GD",
                 "areaType":"country"
              },
              {
                 "iataCode":"GE",
                 "areaType":"country"
              },
              {
                 "iataCode":"GF",
                 "areaType":"country"
              },
              {
                 "iataCode":"GG",
                 "areaType":"country"
              },
              {
                 "iataCode":"GH",
                 "areaType":"country"
              },
              {
                 "iataCode":"GI",
                 "areaType":"country"
              },
              {
                 "iataCode":"GL",
                 "areaType":"country"
              },
              {
                 "iataCode":"GM",
                 "areaType":"country"
              },
              {
                 "iataCode":"GN",
                 "areaType":"country"
              },
              {
                 "iataCode":"GP",
                 "areaType":"country"
              },
              {
                 "iataCode":"GQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"GR",
                 "areaType":"country"
              },
              {
                 "iataCode":"GT",
                 "areaType":"country"
              },
              {
                 "iataCode":"GU",
                 "areaType":"country"
              },
              {
                 "iataCode":"GW",
                 "areaType":"country"
              },
              {
                 "iataCode":"GY",
                 "areaType":"country"
              },
              {
                 "iataCode":"HK",
                 "areaType":"country"
              },
              {
                 "iataCode":"HN",
                 "areaType":"country"
              },
              {
                 "iataCode":"HR",
                 "areaType":"country"
              },
              {
                 "iataCode":"HT",
                 "areaType":"country"
              },
              {
                 "iataCode":"HU",
                 "areaType":"country"
              },
              {
                 "iataCode":"ID",
                 "areaType":"country"
              },
              {
                 "iataCode":"IE",
                 "areaType":"country"
              },
              {
                 "iataCode":"IL",
                 "areaType":"country"
              },
              {
                 "iataCode":"IN",
                 "areaType":"country"
              },
              {
                 "iataCode":"IQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"IR",
                 "areaType":"country"
              },
              {
                 "iataCode":"IS",
                 "areaType":"country"
              },
              {
                 "iataCode":"IT",
                 "areaType":"country"
              },
              {
                 "iataCode":"JE",
                 "areaType":"country"
              },
              {
                 "iataCode":"JM",
                 "areaType":"country"
              },
              {
                 "iataCode":"JO",
                 "areaType":"country"
              },
              {
                 "iataCode":"JP",
                 "areaType":"country"
              },
              {
                 "iataCode":"KE",
                 "areaType":"country"
              },
              {
                 "iataCode":"KG",
                 "areaType":"country"
              },
              {
                 "iataCode":"KH",
                 "areaType":"country"
              },
              {
                 "iataCode":"KI",
                 "areaType":"country"
              },
              {
                 "iataCode":"KM",
                 "areaType":"country"
              },
              {
                 "iataCode":"KN",
                 "areaType":"country"
              },
              {
                 "iataCode":"KP",
                 "areaType":"country"
              },
              {
                 "iataCode":"KR",
                 "areaType":"country"
              },
              {
                 "iataCode":"KW",
                 "areaType":"country"
              },
              {
                 "iataCode":"KY",
                 "areaType":"country"
              },
              {
                 "iataCode":"KZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"LA",
                 "areaType":"country"
              },
              {
                 "iataCode":"LB",
                 "areaType":"country"
              },
              {
                 "iataCode":"LC",
                 "areaType":"country"
              },
              {
                 "iataCode":"LI",
                 "areaType":"country"
              },
              {
                 "iataCode":"LK",
                 "areaType":"country"
              },
              {
                 "iataCode":"LR",
                 "areaType":"country"
              },
              {
                 "iataCode":"LS",
                 "areaType":"country"
              },
              {
                 "iataCode":"LT",
                 "areaType":"country"
              },
              {
                 "iataCode":"LU",
                 "areaType":"country"
              },
              {
                 "iataCode":"LV",
                 "areaType":"country"
              },
              {
                 "iataCode":"LY",
                 "areaType":"country"
              },
              {
                 "iataCode":"MA",
                 "areaType":"country"
              },
              {
                 "iataCode":"MC",
                 "areaType":"country"
              },
              {
                 "iataCode":"MD",
                 "areaType":"country"
              },
              {
                 "iataCode":"ME",
                 "areaType":"country"
              },
              {
                 "iataCode":"MF",
                 "areaType":"country"
              },
              {
                 "iataCode":"MG",
                 "areaType":"country"
              },
              {
                 "iataCode":"MH",
                 "areaType":"country"
              },
              {
                 "iataCode":"MK",
                 "areaType":"country"
              },
              {
                 "iataCode":"ML",
                 "areaType":"country"
              },
              {
                 "iataCode":"MM",
                 "areaType":"country"
              },
              {
                 "iataCode":"MN",
                 "areaType":"country"
              },
              {
                 "iataCode":"MO",
                 "areaType":"country"
              },
              {
                 "iataCode":"MQ",
                 "areaType":"country"
              },
              {
                 "iataCode":"MR",
                 "areaType":"country"
              },
              {
                 "iataCode":"MS",
                 "areaType":"country"
              },
              {
                 "iataCode":"MT",
                 "areaType":"country"
              },
              {
                 "iataCode":"MU",
                 "areaType":"country"
              },
              {
                 "iataCode":"MV",
                 "areaType":"country"
              },
              {
                 "iataCode":"MW",
                 "areaType":"country"
              },
              {
                 "iataCode":"MX",
                 "areaType":"country"
              },
              {
                 "iataCode":"MY",
                 "areaType":"country"
              },
              {
                 "iataCode":"MZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"NA",
                 "areaType":"country"
              },
              {
                 "iataCode":"NC",
                 "areaType":"country"
              },
              {
                 "iataCode":"NE",
                 "areaType":"country"
              },
              {
                 "iataCode":"NG",
                 "areaType":"country"
              },
              {
                 "iataCode":"NI",
                 "areaType":"country"
              },
              {
                 "iataCode":"NL",
                 "areaType":"country"
              },
              {
                 "iataCode":"NO",
                 "areaType":"country"
              },
              {
                 "iataCode":"NP",
                 "areaType":"country"
              },
              {
                 "iataCode":"NR",
                 "areaType":"country"
              },
              {
                 "iataCode":"NZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"OM",
                 "areaType":"country"
              },
              {
                 "iataCode":"PA",
                 "areaType":"country"
              },
              {
                 "iataCode":"PE",
                 "areaType":"country"
              },
              {
                 "iataCode":"PF",
                 "areaType":"country"
              },
              {
                 "iataCode":"PG",
                 "areaType":"country"
              },
              {
                 "iataCode":"PH",
                 "areaType":"country"
              },
              {
                 "iataCode":"PK",
                 "areaType":"country"
              },
              {
                 "iataCode":"PL",
                 "areaType":"country"
              },
              {
                 "iataCode":"PR",
                 "areaType":"country"
              },
              {
                 "iataCode":"PS",
                 "areaType":"country"
              },
              {
                 "iataCode":"PT",
                 "areaType":"country"
              },
              {
                 "iataCode":"PW",
                 "areaType":"country"
              },
              {
                 "iataCode":"PY",
                 "areaType":"country"
              },
              {
                 "iataCode":"QA",
                 "areaType":"country"
              },
              {
                 "iataCode":"RE",
                 "areaType":"country"
              },
              {
                 "iataCode":"RO",
                 "areaType":"country"
              },
              {
                 "iataCode":"RS",
                 "areaType":"country"
              },
              {
                 "iataCode":"RU",
                 "areaType":"country"
              },
              {
                 "iataCode":"RW",
                 "areaType":"country"
              },
              {
                 "iataCode":"SA",
                 "areaType":"country"
              },
              {
                 "iataCode":"SB",
                 "areaType":"country"
              },
              {
                 "iataCode":"SC",
                 "areaType":"country"
              },
              {
                 "iataCode":"SD",
                 "areaType":"country"
              },
              {
                 "iataCode":"SE",
                 "areaType":"country"
              },
              {
                 "iataCode":"SG",
                 "areaType":"country"
              },
              {
                 "iataCode":"SI",
                 "areaType":"country"
              },
              {
                 "iataCode":"SJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"SK",
                 "areaType":"country"
              },
              {
                 "iataCode":"SL",
                 "areaType":"country"
              },
              {
                 "iataCode":"SM",
                 "areaType":"country"
              },
              {
                 "iataCode":"SN",
                 "areaType":"country"
              },
              {
                 "iataCode":"SO",
                 "areaType":"country"
              },
              {
                 "iataCode":"SR",
                 "areaType":"country"
              },
              {
                 "iataCode":"SS",
                 "areaType":"country"
              },
              {
                 "iataCode":"ST",
                 "areaType":"country"
              },
              {
                 "iataCode":"SV",
                 "areaType":"country"
              },
              {
                 "iataCode":"SX",
                 "areaType":"country"
              },
              {
                 "iataCode":"SY",
                 "areaType":"country"
              },
              {
                 "iataCode":"SZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"TC",
                 "areaType":"country"
              },
              {
                 "iataCode":"TD",
                 "areaType":"country"
              },
              {
                 "iataCode":"TG",
                 "areaType":"country"
              },
              {
                 "iataCode":"TH",
                 "areaType":"country"
              },
              {
                 "iataCode":"TJ",
                 "areaType":"country"
              },
              {
                 "iataCode":"TL",
                 "areaType":"country"
              },
              {
                 "iataCode":"TM",
                 "areaType":"country"
              },
              {
                 "iataCode":"TN",
                 "areaType":"country"
              },
              {
                 "iataCode":"TO",
                 "areaType":"country"
              },
              {
                 "iataCode":"TR",
                 "areaType":"country"
              },
              {
                 "iataCode":"TT",
                 "areaType":"country"
              },
              {
                 "iataCode":"TV",
                 "areaType":"country"
              },
              {
                 "iataCode":"TW",
                 "areaType":"country"
              },
              {
                 "iataCode":"TZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"UA",
                 "areaType":"country"
              },
              {
                 "iataCode":"UG",
                 "areaType":"country"
              },
              {
                 "iataCode":"US",
                 "areaType":"country"
              },
              {
                 "iataCode":"UY",
                 "areaType":"country"
              },
              {
                 "iataCode":"UZ",
                 "areaType":"country"
              },
              {
                 "iataCode":"VC",
                 "areaType":"country"
              },
              {
                 "iataCode":"VE",
                 "areaType":"country"
              },
              {
                 "iataCode":"VG",
                 "areaType":"country"
              },
              {
                 "iataCode":"VI",
                 "areaType":"country"
              },
              {
                 "iataCode":"VN",
                 "areaType":"country"
              },
              {
                 "iataCode":"VU",
                 "areaType":"country"
              },
              {
                 "iataCode":"WF",
                 "areaType":"country"
              },
              {
                 "iataCode":"WS",
                 "areaType":"country"
              },
              {
                 "iataCode":"YE",
                 "areaType":"country"
              },
              {
                 "iataCode":"ZA",
                 "areaType":"country"
              },
              {
                 "iataCode":"ZM",
                 "areaType":"country"
              },
              {
                 "iataCode":"ZW",
                 "areaType":"country"
              }
           ]
        },
        "mask":{
           "date":"2022-05-05",
           "text":"<p>Wearing face masks are mandatory in all public areas nationwide, including public transport, markets and shopping malls. Face shields are also mandatory on top of face masks in crowded, closed and close contact spaces. The face shield mandate was lifted in Manila except for hospitals.</p>",
           "isRequired":"Yes"
        },
        "exit":{
           "date":"2022-05-05",
           "text":"<p>Filipino nationals intending to exit the country must acquire a permit from the government.</p>",
           "specialRequirements":"Yes",
           "isBanned":"Yes"
        },
        "otherRestriction":{
           
        },
        "diseaseVaccination":{
           "date":"2022-05-05",
           "text":"<p>An individual is considered vaccinated two or more weeks after receiving either single or double dose vaccinations.</p> <p>Fully vaccinated Filipino nationals and fully vaccinated foreign nationals from are permitted entry without undergoing quarantine. For quarantine rules, check <a href=\"https://www.philippineairlines.com/en/covid-19/arrivingintheph\" target=\"_blank\" rel=\"noopener\">here</a>.</p> <p>Only foreign nationals who are fully vaccinated against COVID-19 at least two weeks prior to arrival are permitted entry. Those aged 12 and under are exempt from vaccine requirements.</p> <p>Unvaccinated <strong>Filipino nationals</strong> and fully vaccinated foreign nationals who have recovered from COVID-19 with proof of a positive PCR test taken 10-30 days prior to departure are allowed entry. Travellers who have recently recovered from COVID-19 must provide a PCR test result issued 48 hours before travel or a positive PCR test result given 10-30 days prior to departure from the country of origin; and a medical certificate proving that they are no longer infectious.</p>",
           "isRequired":"No",
           "referenceLink":"https://www.philippineairlines.com/en/ph/home/covid-19/arrivingintheph",
           "acceptedCertificates":[
              "Paper Certificate",
              " NHS Covid Pass",
              " EU Digital COVID Certificate",
              " Yellow Book",
              " Vietnam certificate"
           ],
           "qualifiedVaccines":[
              "Pfizer - 14 days after second dose.",
              "AstraZeneca (Vaxzevria) - 14 days after second dose.",
              "Vaxevria (South Korea) - 14 days after second dose.",
              "Covishield (India) - 14 days after second dose.",
              "Johnson & Johnson - 14 days after first dose.",
              "Sinopharm (Beijing) - 14 days after second dose.",
              "CoronaVac - 14 days after second dose.",
              "Moderna - 14 days after second dose.",
              "Sputnik V - 14 days after second dose.",
              "Sinopharm (Wuhan) - 15 days after second dose.",
              "Covaxin - 14 days after second dose.",
              "Nuvaxovid (Novavax) - 14 days after second dose.",
              "Covovax (Novavax) - 14 days after second dose.",
              "Immunity through previous infection - positive test older than 10 days, not older than 1 months."
           ],
           "policy":"Yes",
           "exemptions":"Entry Ban, Quarantine"
        }
     },
     "areaPolicy":{
        "date":"2022-05-05",
        "text":"<p>Restrictions on gatherings and some business operations remain for much of the country, while curfews are present in some areas.</p>",
        "status":"Partial Measures",
        "startDate":"2020-03-20",
        "endDate":"indef"
     },
     "relatedArea":[
        {
           "methods":[
              "GET"
           ],
           "rel":"Parent"
        }
     ],
     "areaVaccinated":[
        {
           "date":"2022-05-05",
           "vaccinationDoseStatus":"oneDose",
           "percentage":67.046
        },
        {
           "date":"2022-05-11",
           "vaccinationDoseStatus":"fully",
           "percentage":61.71
        }
     ],
     "type":"covid19-area-report"
  }
}