[
    {
        "_id": 1,
        "date_of_publication": "2022-03-10T10:50:49+11:00",
        "headline": "CORONAVIRUS DISEASE 2019 UPDATE (68): BRAIN CHANGES, BOOSTERS, HOTSPOTS, USA, WHO, GLOBAL",
        "main_text": "WHO region (no. countries/territories):<br/>Total confirmed cases (new cases in last 24 hours) / Total deaths (new deaths in last 24 hours)<br/>--------------------------------------------------------------------------------<br/>Western Pacific Region (19): 28 535 225 (511 442) / 188 763 (827)<br/>European Region (61): 183 755 057 (511 923) / 1 891 911 (2453)<br/>South-East Asia Region (10): 56 225 517 (53 605) / 766 611 (579)<br/>Eastern Mediterranean Region (22): 21 348 153 (26 164) / 337 104 (270)<br/>Region of ",
        "diseases": [ 42 ],
        "url": "https://promedmail.org/promed-post/?id=8701903" 
    },
    {
        "_id": 2,
        "date_of_publication": "2019-02-08T23:59:01+11:00",
        "headline": "PRO/EDR> Measles update (09): Americas, Asia, Indian Ocean, Europe, worldwide, vaccine",
        "main_text": "MEASLES UPDATE (09): AMERICAS, ASIA, INDIAN OCEAN, EUROPE, WORLDWIDE, VACCINE\n*****************************************************************************\nA ProMED-mail post\n<http://www.promedmail.org>\nProMED-mail is a program of the\nInternational Society for Infectious Diseases\n<http://www.isid.org>\n\nIn this update:\r\nAmericas\r\n---\r\n[1] USA (Washington state, Clark county): Russian community\r\n[2] USA (Washington state Clark county): danger of outbreak\r\n[3] USA (Washington state, Clark county): low vaccination rate\r\n[4] USA (Washington state, Clark county)\r\n\r\nAsia\r\n---\r\n[5] Philippines: outbreak expanding\r\n[6] Philippines: spread beyond capital\r\n\r\nIndian Ocean\r\n---\r\n[7] Madagascar: 50 000 cases\r\n\r\nEurope\r\n---\r\n[8] Cases soar\r\n\r\nWorldwide\r\n---\r\n[9] 2017: 109 000 people died\r\n\r\n[10] Vaccine: complacency\r\n\r\n******\r\nAmericas\r\n---\r\n[1] USA (Washington state, Clark county, Portland): Russian community\r\nDate: Wed 6 Feb 2019\r\nSource: KOMO News [abridged, edited]\r\n<https://komonews.com/news/local/sad-reality-handful-of-wa-measles-outbreak-sites-are-in-russian-speaking-communities>\r\n\r\n\r\nAt least 8 outbreak sites in Clark county or Portland [Washington] are, or have been, in Slavic churches or schools. In fact, Russian-speaking communities, according to a 2012 report -- the last of its kind -- have the lowest vaccination rates in Washington state.\r\n\r\nThe Department of Health (DOH) partnered with the Washington State Health Care Authority to better understand what is behind low immunization rates in Russian-speaking communities -- a pattern that's been consistent since 2008.\r\n\r\n\"Any medicine has potential risk and danger,\" said a focus group participant in the report. \"My own life is one thing, but my child's life is a completely different thing.\"\r\n\r\nNegative beliefs around vaccination centers around mistrust of healthcare, language and cultural barriers, strong dissatisfaction with healthcare providers based on pressure, lack of information about vaccination, and disrespect -- among other things.\r\n\r\n\"Many Slavic immigrants endured the harshness of the Soviet regime under a totalitarian government,\" said Stasyuk, who is a senior data analyst with the Washington Health Alliance. \"This has led to a lot of anti-government sentiment and a distrust of the academy, science, and public health, which were sponsored by the government.\"\r\n\r\n\"Also, there is a general lack of science and health education, which has led some Slavics to prefer conspiracy theories,\" he added. \"Humans are prone to exaggerate negative news -- stories of medical malpractice or vaccine side effects are more memorable than the story of a million saved lives.\"\r\n\r\nThe Soviet Union used coercive immunization campaigns to get its citizens to vaccinate and maintain a strong, healthy labor workforce, Washington State University history professor Steven L Hoch cites in his research paper [see comment below]. When it fell apart, soviet society lost its rational and financial means to support these campaigns, entrusting that responsibility to parents, who were becoming conscious of their rights.\r\n\r\n\"As far as I know, in the USSR vaccination was mandatory, so everyone I knew was vaccinated,\" said Stasyuk, who immigrated from the Ukraine when he was 7. \"It was only when we came to America, acquired access to the internet with its plethora of opinions, and learned about the freedom to dissent that people came up with different opinions about vaccination.\"\r\n\r\nBack home in Russia, this deep-rooted distrust in authority has caused parents not to vaccinate their kids as a form of expression. In 2018, legislation was passed that required parents' consent before any medical procedure, making it easier to oppose vaccination altogether.\r\n\r\nLast year [2018] alone, there were over 23 000 measles cases in Ukrainian children and adults and over 1000 cases in Russia, according to the World Health Organization.\r\n\r\nMisinformation online is adding to low vaccination rates. Scientists at George Washington University in DC discovered several accounts -- the same ones that belonged to Russian trolls who interfered in the US election -- skewing online debate about the safety of vaccines.\r\n\r\nIn Washington state, which boasts 26 000 Russian immigrants, the DOH report found that using personal social networks in faith communities to advocate for vaccines, offering community presentations on immunization, and providing Russian-language resources online, among other things, would help close the anti-vaccination gap.\r\n\r\n\"We try to make immunization education materials accessible to as many people in Washington as possible,\" said Liz Coleman with the DOH. \"We publish as many immunization materials as we can in the top 4 languages spoken in Washington, one of which is Russian.\"\r\n\r\n[Byline: Karina Mazhukhina]\r\n\r\n--\r\nCommunicated by:\r\nProMED-mail from HealthMap Alerts\r\n<promed@promedmail.org>\r\n\r\n[See this thesis: Hoch SL. The Social Consequences of Soviet Immunization Policies, 1945-1980. University of Iowa. The National Council for Eurasian and East European Research. <https://www.ucis.pitt.edu/nceeer/1997-812-03g-Hoch.pdf> for background on Soviet immunization policy, perhaps explaining current vaccine hesitancy in the US of people of Russian origin. - Mod.LK]\r\n\r\n******\r\n[2] Washington state (Clark county): danger of outbreak\r\nDate: Wed 6 Feb 2019 8:42 PM PST\r\nSource: The Washington Post [abridged, edited]\r\n<https://wapo.st/2SyYkki>\r\n\r\n\r\n[AG] is afraid to leave her house with her infant son because she lives at the epicenter of Washington state's worst measles outbreak in more than 2 decades. Born 8 weeks ago, [the baby] is too young to get his 1st measles shot, putting him at risk for the highly contagious respiratory virus, which can be fatal in small children.\r\n\r\n[AG] also lives in a community where she said being anti-vaccine is as acceptable as being vegan or going gluten free. Almost a quarter of kids in Clark county, Washington, a suburb of Portland, Oregon, go to school without measles, mumps, and rubella immunizations, and Washington Gov Jay Inslee (D) recently declared a state of emergency amid concern that things could rapidly spin out of control.\r\n\r\nMeasles outbreaks have sprung up in 9 other states this winter [2018-19], but officials are particularly alarmed about the one in Clark county because of its potential to go very big, very quickly.\r\n\r\nThe Pacific Northwest is home to some of the nation's most vocal and organized anti-vaccination activists. That movement has helped drive down child immunizations in Washington, as well as in neighboring Oregon and Idaho, to some of the lowest rates in the country, with as many as 10.5 percent of kindergartners statewide in Idaho unvaccinated for measles. That is almost double the median rate nationally.\r\n\r\nLibertarian-leaning lawmakers, meanwhile, have bowed to public pressure to relax state laws to exempt virtually any child from state vaccination requirements whose parents object. 3 states allow only medical exemptions; most others also permit religious exemptions. And 17, including Washington, Oregon, and Idaho, allow what they call \"philosophical\" exemptions, meaning virtually anyone can opt out of the requirements.\r\n\r\nAll those elements combine into a dangerous mix, spurring concern about the resurgence of a deadly disease that once sent tens of thousands of Americans to hospitals each year and killed an estimated 400-500 people, many of them young children.\r\n\r\n\"You know what keeps me up at night?\" said Clark County Public Health Director Alan Melnick. \"Measles is exquisitely contagious. If you have an under-vaccinated population, and you introduce a measles case into that population, it will take off like a wildfire.\"\r\n\r\nTo date, at least 55 people in Washington and neighboring Oregon have gotten sick with the virus, with new cases tallied almost daily. All but 5 are in Clark county. King county, which includes Seattle, has one case; Multnomah county in Oregon, which includes Portland, has 4, including 3 cases reported [Wed 6 Feb 2019]. Most of those infected are unvaccinated children under 10, health officials said.\r\n\r\nMeasles, which remains endemic in many parts of the world, generally returns to the United States when infected travelers bring the disease back to pockets of the country where some parents have chosen not to vaccinate their children. When immunization rates fall below a certain threshold, outbreaks can occur; pregnant women, young children and people with compromised immune systems who can't get vaccinated are especially at risk. Last year, 349 cases were confirmed across 26 states and the District of Columbia, the second highest total since the disease was declared eliminated from the United States in 2000, according to the Centers for Disease Control and Prevention.\r\n\r\nSince October [2018], an outbreak in New York's Orthodox Jewish community has sickened 209 people. In the 1st month of 2019, 10 states, including New York and Washington, have reported cases, all signs of a resurgence of a disease that is entirely preventable with a vaccine that authorities say is safe and effective.\r\n\r\nIn Washington, with late winter and spring generally the height of measles transmission, health officials say they are scrambling to stop the disease before it can spread further -- spending about USD 200 000 so far tracking down hundreds of unvaccinated people who may have been exposed.\r\n\r\nClark county officials are directing hundreds of susceptible families who may have been exposed to the virus at more than 3 dozen locations -- including a Portland Trailblazers basketball game, schools, churches and stores such as Costco and Walmart -- to keep their kids home from school fordays ",
        "diseases": [ 2 ],
        "url": "https://promedmail.org/promed-post/?id=6305944"
    }, 
    {
        "_id": 3,
        "date_of_publication": "2016-09-04 22:48:45+11:00",
        "headline": "PRO/EDR> Zika virus (45): worldwide, WHO, research, comment",
        "main_text": "ZIKA VIRUS (45): WORLDWIDE, WHO, RESEARCH, COMMENT\n**************************************************\nA ProMED-mail post\n<http://www.promedmail.org>\nProMED-mail is a program of the\nInternational Society for Infectious Diseases\n<http://www.isid.org>\n\nIn this update:\r\n[1] WHO worldwide\r\n[2] Zika virus infection and Guillain-Barre syndrome\r\n[3] Virus persistence in newborns\r\n[4] Vaginal infection, mouse model\r\n[5] Culex vectors NOT\r\n[6] Vector dissemination\r\n\r\n******\r\n[1] WHO worldwide\r\nDate: 1 Sep 2016\r\nSource: WHO situation report [edited]\r\n<http://apps.who.int/iris/bitstream/10665/249597/1/zikasitrep1Sept16-eng.pdf?ua=1>\r\n\r\n\r\nAnalysis\r\n- Overall, the global risk assessment has not changed.\r\n- The geographic expansion of Zika virus, after having slowed in April through June 2016, has increased somewhat in July and August 2016. This is likely due to increased activity of the mosquito vector in the northern hemisphere during the warmer summer months.\r\n- While some countries such as those in South America are reporting downward trends in Zika transmission, other areas including those recently affected (for example, Saint Barthelemy in the Caribbean) and those affected earlier (for example, Puerto Rico) are experiencing upward trends. As most countries do not report absolute numbers of Zika cases, it is not possible to make generalizations about the global trend of the Zika outbreak.\r\n- Although the African lineage preliminarily identified in Guinea-Bissau has not been associated with microcephaly and other neurologic complications, further surveillance is needed as there have been very few confirmed cases of the African lineage. At this point, it is still too early to dismiss this possible threat.\r\n\r\nSituation\r\n- 72 countries and territories (figure 1, table 1 [see URL above for figures and tables]) have reported evidence of mosquitoborne Zika virus transmission since 2007 (69 with reports from 2015):\r\n- 55 with a 1st reported outbreak from 2015 onwards (figure 2, table 1).\r\n- Four with having possible endemic transmission or evidence of local mosquitoborne Zika infections in 2016.\r\n- 13 with evidence of local mosquitoborne Zika infections in or before 2015, but without documentation of cases in 2016, or with the outbreak terminated.\r\n\r\n- Since February 2016, 11 countries have reported evidence of person-to-person transmission of Zika virus (table 2).\r\n\r\n- 20 countries or territories have reported microcephaly and other CNS malformations potentially associated with Zika virus infection or suggestive of congenital infection (table 3). Four of the 20 countries reported microcephalic babies born from mothers in countries with no endemic Zika virus transmission but who reported recent travel history to Zika-affected countries.\r\n\r\n- Outcomes of pregnancies with laboratory evidence of possible Zika virus in the United States of America:\r\n- 16 total liveborn infants with birth defects\r\n- Five total pregnancy losses with birth defects\r\n\r\n- Outcomes of pregnancies with laboratory evidence of possible Zika virus in territories of the United States of America:\r\n- One total liveborn infant with birth defects\r\n- One total pregnancy loss with birth defects\r\n\r\n- 18 countries and territories have reported an increased incidence of GBS and/or laboratory confirmation of a Zika virus infection among GBS cases (table 4). \r\n\r\n- In Guinea-Bissau, the gene sequencing results of the four confirmed Zika cases sent in July 2016 have preliminarily confirmed that the cases are of the African lineage -- that is, not the predominant global outbreak Asian lineage. The investigation of 5 reported cases of microcephaly is ongoing.\r\n\r\n- The 2016 Summer Paralympic Games will be held in Rio de Janeiro, Brazil, from 7 to 18 Sep 2016. WHO, particularly through the Regional Office for the Americas, continues to provide technical support to the Ministry of Health to ensure the 2016 Summer Paralympic Games are as safe as possible for all athletes, volunteers, visitors and residents.\r\n\r\nTable 1. Countries reporting mosquitoborne Zika virus transmission (data as of 31 Aug 2016):\r\nCategory 1: Countries with a 1st reported outbreak from 2015 onward:\r\n - Africa: Cabo Verde; Guinea-Bissau\r\n - Americas: Anguilla; Antigua and Barbuda; Argentina; Aruba; Bahamas; Barbados; Belize; Bolivia (Plurinational State of), Bonaire, Sint Eustatius and Saba - Netherlands*; Brazil; British Virgin Islands; Cayman Islands; Colombia; Costa Rica; Cuba; Curacao; Dominica; Dominican Republic; Ecuador; El Salvador; French Guiana; Grenada; Guadeloupe; Guatemala; Guyana; Haiti; Honduras; Jamaica; Martinique; Mexico; Nicaragua; Panama; Paraguay; Peru; Puerto Rico; Saint Barthelemy; Saint Lucia; Saint Martin; Saint Vincent and the Grenadines; Sint Maarten; Suriname; Trinidad and Tobago; Turks and Caicos; United States of America; United States Virgin Islands; Venezuela (Bolivarian Republic of) \r\n - Pacific: American Samoa; Fiji; Marshall Islands; Micronesia (Federated States of); Samoa; Singapore; Tonga \r\nCategory 2: Countries with possible endemic transmission or evidence of local mosquitoborne Zika infections in 2016:\r\n - South East Asia: Indonesia, Thailand, Philippines, Viet Nam\r\n\r\nCategory 3: Countries with evidence of local mosquitoborne Zika infections in or before 2015, but without documentation of cases in 2016, or outbreak terminated:\r\n - Africa: Gabon\r\n - Western Pacific: Easter Island (Chile)\r\n - South Asia and Indian Ocean: Bangladesh, Maldives\r\n - Southeast Asia and Western Pacific: Cambodia; Cook Islands**; French Polynesia**; Lao People's Democratic Republic; Malaysia; New Caledonia; Papua New Guinea; Solomon Islands; Vanuatu\r\n\r\n*This includes confirmed Zika virus cases reported in Bonaire - Netherlands, Sint Eustatius and Saba - Netherlands.\r\n**These countries and territories have not reported Zika virus cases in 2015 or 2016.\r\n\r\nCategories are defined as follows:\r\nCategory 1: Countries with a 1st reported outbreak from 2015 onwards\r\n- A laboratory confirmed, autochthonous, mosquitoborne case of Zika virus infection in an area where there is no evidence of circulation of the virus in the past (prior 2015), whether it is detected and reported by the country itself or by another state party diagnosing returning travellers, or\r\n- A laboratory confirmed, autochthonous, mosquitoborne case of Zika virus infection in an area where transmission has been previously interrupted. The assumption is that the size of the susceptible population has built up to a sufficient level to allow transmission again; the size of the outbreak will be a function of the size of the susceptible population, or\r\n- An increase of the incidence of laboratory confirmed, autochthonous, mosquitoborne Zika virus infection in areas where there is ongoing transmission, above 2 standard deviations of the baseline rate, or doubling the number of cases over a 4-week period. Clusters of febrile illnesses, in particular when epidemiologically-linked to a confirmed case, should be microbiologically investigated.\r\n\r\nCategory 2: Countries with possible endemic transmission or evidence of local mosquito-borne Zika infections in 2016 with the reporting period beginning in 2007\r\n- Countries or territories that have reported an outbreak with consistent presence of laboratory confirmed, autochthonous, mosquitoborne cases of Zika virus infection 12 months after the outbreak, or\r\n- Countries or territories where Zika virus has been circulating for several years with consistent presence of laboratory confirmed, autochthonous, mosquitoborne cases of Zika virus infection or evidence of local mosquito-borne Zika infections in 2016. Reports can be from the country or territory where infection occurred, or from a 3rd party where the case is 1st recorded according to the International Health Regulations (IHR 2005). Countries with evidence of infection prior to 2007 are listed in <http://www.who.int/bulletin/online_1st/16-171082.pdf>.\r\n\r\nCategory 3: Countries with evidence of local mosquitoborne Zika infections in or before 2015, but without documentation of cases in 2016, or outbreak terminated with the reporting period beginning in 2007\r\n- Absence of confirmed cases over a 3-month period in a specific geographical area with climatic conditions suitable for year-round arbovirus transmission, or over a 12-month period in an area with seasonal vector activity.\r\n\r\nTable 2. Countries reporting non mosquitoborne Zika virus transmission since February 2016\r\nCountries with evidence of person-to-person transmission of Zika virus, other than mosquitoborne transmission:\r\nAmericas: Argentina, Canada, Chile, Peru, USA\r\nEurope: France, Germany, Italy, Portugal, Spain\r\nWestern Pacific: New Zealand\r\n\r\nTable 3. Countries and territories reporting microcephaly and/or CNS malformation cases potentially associated with Zika virus infection\r\n\r\nCountry / No. cases microcephaly or CNS malformation suggestive or potentially associated with Zika virus infections:\r\nBrazil / 1845\r\nCabo Verde / 9\r\nCanada / 1\r\nCosta Rica / 1\r\nColombia / 34 \r\nDominican Republic / 3\r\nEl Salvador / 4\r\nFrench Guiana / 3\r\nFrench Polynesia / 8 \r\nHaiti / 1\r\nHonduras / 1\r\nMarshall Islands / 1\r\nMartinique / 10\r\nPanama / 5\r\nParaguay / 2\r\nPuerto Rico / 1\r\nSlovenia (ex Brazil) / 1\r\nSpain (ex Colombia, Venezuela) / 2\r\nSuriname / 1\r\nUSA (ex various) / 21\r\n\r\nTable 4. Countries and territories reporting Guillain-Barre syndrome (GBS) potentially associated with Zika virus infection\r\n- Reported increase in incidence of GBS cases, with at least one GBS case with confirmed Zika virus infection:\r\nBrazil, Colombia, Dominican Republic, El Salvador*, French Guiana, French Polynesia, Honduras, Jamaica, Martinique, Suriname**, Venezuela\r\n\r\n- No increase",
        "diseases": [ 38 ]
    },
    {
        "_id": 4,
        "date_of_publication": "2022-03-10T13:08:51+11:00",
        "headline": "PRO/AH/EDR> Chronic wasting disease - North America (02): (USA) deer",
        "main_text": "The Iowa Department of Natural Resources reports 36 positive chronic wasting disease (CWD) tests from some 5000 deer samples this hunting season.<br/><br/>The DNR's Tyler Harms, who oversees the deer management program, says 2 new counties were added to the list of counties in which CWD has been detected in the wild. Greene County in central Iowa and Fremont County in southwest Iowa brings the total number of counties to 12.",
        "diseases": [ 1 ],
        "url": "https://promedmail.org/promed-post/?id=8701909"  
    }
]